/////// COMMON
IDC_DGN_DESIGN_CODE                           = "設計規範"
IDC_DGN_NATL_ANNEX                            = "National Annex"
IDC_DGN_SECTION_LIST                          = "斷面清單"
IDC_DGN_GENERAL                               = "一般"
IDC_DGN_DESIGN                                = "設計"
IDC_DGN_DRAWING                               = "繪圖"
IDC_DGN_WORD                                  = "Word"
IDC_DGN_SYSTEM                                = "系統"
IDC_DGN_LAYER                                 = "圖層"
IDC_DGN_LAYOUT                                = "Layout"
IDC_DGN_FILE                                  = "檔案"
IDC_DGN_DWG                                   = "DWG"
IDC_DGN_DESIGN_FORCE                          = "設計力量"
IDC_DGN_MEMBER_NAME                           = "構件名稱"
IDC_DGN_BAR_SPACE_MOMENT                      = "彎矩"
IDC_DGN_BAR_SPACE_SHEAR                       = "剪力"
IDC_DGN_SECTION                               = "斷面"
IDC_DGN_WAVE_DASH                             = "~"
IDC_DGN_BUTTON_DESIGN                         = "設計"
IDC_DGN_BUTTON_OK                             = "&確認"
IDC_DGN_BUTTON_APPLY                          = "&套用"
IDC_DGN_BUTTON_CLOSE                          = "&關閉"
IDC_DGN_BUTTON_CANCEL                         = "&取消"
IDC_DGN_BUTTON_DEFAULT                        = "&回復預設值"
IDC_DGN_BUTTON_ADD                            = "&新增"
IDC_DGN_BUTTON_DELETE                         = "&刪除"
IDC_DGN_BUTTON_INSERT                         = "&插入"

IDC_DGN_TAB_SECTION                           = "資料表"
IDC_DGN_TAB_REBAR                             = "鋼筋"
IDC_DGN_TAB_FORCE                             = "外力"
IDC_DGN_TAB_DESIGN                            = "設計"
IDC_DGN_TAB_LOAD_INFO                         = "Load"
IDC_DGN_TAB_MATERIAL_INFO                     = "Material"
IDC_DGN_TAB_SECTION_INFO                      = "資料表"
IDC_DGN_TAB_SECTION_INFO_1                    = "資料表-1"
IDC_DGN_TAB_SECTION_INFO_2                    = "資料表-2"
IDC_DGN_TAB_SECTION_INFO_3                    = "資料表-3"
IDC_DGN_TAB_SECTION_INFO_4                    = "資料表-4"
IDC_DGN_TAB_REBAR_INFO                        = "鋼筋"
IDC_DGN_TAB_FORCE_INFO                        = "外力"
IDC_DGN_TAB_DESIGN_INFO                       = "設計"
IDC_DGN_TAB_OPTION_INFO                       = "Option"
IDC_DGN_TAB_FOOTING_INFO                      = "基礎"
IDC_DGN_TAB_REINFOCE_MATERIAL                 = "材料"
IDC_DGN_TAB_REINFOCE_POSITION                 = "位置"
IDC_DGN_TAB_BASE_PLATE                        = "基座板"
IDC_DGN_TAB_RIB_PLATE                         = "肋板"
IDC_DGN_TAB_ANCHOR_BOLT                       = "錨栓"
IDC_DGN_TAB_WELDING                           = "銲接"
IDC_DGN_TAB_PLATE                             = "板材"
IDC_DGN_TAB_RIB                               = "肋板"
IDC_DGN_TAB_BOLT                              = "螺栓"

IDC_DGN_SYNC_WITH_INFO_TABLE                  = "Sync with Info. Table"
IDC_DGN_SELECTED_ONLY                         = "Selected Only"

////// IDD_DGN_LINK_DLG
IDD_DGN_LINK_DLG                              = "Link"
IDC_LINK_BTN                                  = "連結"
IDC_DELINK_BTN                                = "取消連結"
IDC_LINK_TEXT                                 = "連結至 :"

///// IDD_DGN_UPLINK_SELECT_DLG
IDD_DGN_UPLINK_SELECT_DLG                     = "Select Link Data"
IDS_DGN_UPLINK_NOT_SELECT_STORY               = "Story is NOT Selected."
IDS_DGN_UPLINK_NOT_SELECT_GROUP               = "Group is NOT Selected."
IDS_DGN_UPLINK_NOT_SELECT_WALL_MARK           = "Wall Mark is NOT Selected."
IDS_DGN_UPLINK_FAIL_SAVE_FILE                 = "Saving Export Data to File is Failed."
IDS_DGN_UPLINK_SUPPORT_BY_OPTION              = "The export function cannot be used.\nIt can only be used if you have the appropriate option."
IDS_DGN_UPLINK_SELECT_MEMB                    = "Select Member to Export"
IDS_DGN_UPLINK_SETTING                        = "UP Link Setting"
IDS_DGN_UPLINK_SECT_NOT_APPLIED               = "Section setting is not applied."
IDS_DGN_UPLINK_SECT_ANA_APPLIED               = "Section for Analysis setting is applied."
IDS_DGN_UPLINK_SECT_DGN_APPLIED               = "Section for Design setting is applied."
IDS_DGN_UPLINK_THCK_NOT_APPLIED               = "Thickness setting is not applied."
IDS_DGN_UPLINK_THCK_ANA_APPLIED               = "Thickness for Analysis setting is applied."
IDS_DGN_UPLINK_THCK_DGN_APPLIED               = "Thickness for Design setting is applied."
IDS_DGN_UPLINK_MATL_NOT_APPLIED               = "Material setting is not applied."
IDS_DGN_UPLINK_MATL_ANA_APPLIED               = "Material for Analysis setting is applied."
IDS_DGN_UPLINK_MATL_DGN_APPLIED               = "Material for Design setting is applied."

///// IDD_DGN_PREF_DESIGN_SECTION_DLG
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_SECTION       = "回復預設值"
IDC_DGN_PREF_DESIGN_FRAME_INCREASE_RCS        = "斷面增量 (RC)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_SLAB       = "樓版"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_BEAM_GIRDER = "梁"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_COLUMN     = "柱"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_SHEAR_WALL = "剪力牆"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_FOOTING    = "基礎"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUCBF      = "聯合基礎"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_BASE_WALL  = "地下室外牆"
IDC_DGN_PREF_DESIGN_STRING_INCREASE_GURST     = "樓梯"
IDC_DGN_PREF_DESIGN_STRING_INCREASE_GURBU     = "扶壁"
IDC_DGN_PREF_DESIGN_STRING_INCREASE_GURCB     = "托梁/托架"
IDC_DGN_PREF_DESIGN_FRAME_INCREASE_SRC        = "斷面增量 (SRC)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUCCO      = "柱 (包覆型)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUCFT      = "CFT柱"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GURSF      = "連續基礎"
IDC_DGN_PREF_DESIGN_FRAME_INCREASE_RFM        = "斷面增量 (構件補強)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUFSL      = "樓版"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUFBE      = "梁"

/// IDD_DGN_PREF_DESIGN_SRC_DLG
IDC_DGN_PREF_DESIGN_CHECK_GUCCO_B             = "最大寬度"
IDC_DGN_PREF_DESIGN_CHECK_GUCCO_D             = "最大高度"
IDC_DGN_PREF_DESIGN_CHECK_GUCCO_R             = "最大鋼構面積比"
IDC_DGN_PREF_FRAME_COLUMN_ENCASED             = "柱 (包覆型)"
IDC_DGN_PREF_DESIGN_CHECK_GUCCO               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GUCFT_B             = "最大寬度"   
IDC_DGN_PREF_DESIGN_CHECK_GUCFT_D             = "最大高度"   
IDC_DGN_PREF_DESIGN_CHECK_GUCFT_R             = "最大鋼構面積比"
IDC_DGN_PREF_FRAME_CFT_COLUMN                 = "CFT柱"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_SRC           = "回復預設值"
IDC_DGN_PREF_DESIGN_CHECK_GUCFT               = "依設計結果變更斷面"

// IDD_DGN_PREF_DESIGN_STL_DLG
IDC_DGN_PREF_DESIGN_CHECK_FRAME_BASEPLATE     = "基座板"
IDC_DGN_PREF_DESIGN_CHECK_GUSBP               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GUSBP_B             = "最大寬度"     
IDC_DGN_PREF_DESIGN_CHECK_GUSBP_D             = "最大高度"     
IDC_DGN_PREF_DESIGN_LABEL_GUSEP               = "預埋板"
IDC_DGN_PREF_DESIGN_CHECK_GUSEP               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GUSEP_B             = "最大寬度"     
IDC_DGN_PREF_DESIGN_CHECK_GUSEP_D             = "最大高度"     
IDC_DGN_PREF_DESIGN_LABEL_GUSWB               = "Corrugated Web Beam"
IDC_DGN_PREF_DESIGN_CHECK_GUSWB               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUSWB_B             = "Change Width"
IDC_DGN_PREF_DESIGN_CHECK_GUSWB_D             = "Change Height"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_STL           = "回復預設值"

/// IDD_DGN_PREF_DESIGN_WALL_DLG
IDC_DGN_PREF_DESIGN_FRAME_GURSW               = "剪力牆"
IDC_DGN_PREF_DESIGN_CHECK_GURSW               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GURSW_D             = "最大厚度"
IDC_DGN_PREF_DESIGN_CHECK_GURSW_GEN           = "使用Gen/ADS的設計方法"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RC1           = "回復預設值"
IDC_DGN_PREF_DESIGN_LABEL_GURSW_GEN           = "設計方法"
IDC_DGN_PREF_DESIGN_LABEL_GURSW_GEN2          = "端部鋼筋數量"

////// IDD_DGN_PREF_DLG
IDD_DGN_PREF_DLG                              = "偏好設定"
IDC_DGN_PREF_BTN_DEFAULT_ALL                  = "回復預設值 (All)"
IDC_DGN_PREF_BTN_CLOSE                        = "取消"
IDC_DGN_PREF_BTN_OK                           = "確認"

IDD_DGN_DGNOPT_DLG                            = "設計選項"
IDD_DGN_DWGOPT_DLG                            = "繪圖選項"
IDS_DGN_MSG_RESET_OPTION_DATA                 = "確定要重設所有選項?"
IDC_DGN_PREF_DESIGN_LBL_BATCH_BEAM            = "※ ""Change Section by Design"" is not applied in Batch Beam"
IDC_DGN_PREF_DESIGN_LBL_BATCH_COLM            = "※ ""Change Section by Design"" is not applied in Batch Column"

///// IDD_DGN_PREF_DRAWING_DLG
IDC_DGN_PREF_BTN_DEFAULT_DRAWING              = "回復預設值"

/// IDD_DGN_PREF_DRAWING_DWG_DLG
IDC_DGN_PREF_DRAWING_DWG_CHECK_TIEBAR         = "建立箍筋"
IDC_DGN_PREF_DRAWING_DWG_CHECK_BARNAME        = "依強度命名"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_BEAM        = "RC梁"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_COLUMN      = "RC柱"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_GENCOL      = "RC柱 (任意斷面)"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_FOOTING     = "RC基礎"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_COMB_FOOTING  = "RC聯合基礎"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RFM_BEAM       = "RC補強梁"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RFM_COLM       = "RC補強柱"
IDC_DGN_PREF_BTN_DEFAULT_DRAWING_DWG          = "回復預設值"
IDC_DGN_PREF_DRAWING_DWG_FRAME_TIEBAR         = "柱箍筋"
IDC_DGN_PREF_DRAWING_DWG_STRING_TIEBAR_TYPE   = "圓柱之箍筋型式"
IDC_DGN_PREF_DRAWING_DWG_FRAME_REBAR_NAME     = "鋼筋名稱"
IDC_DGN_PREF_DRAWING_DWG_STRING_NAME_OVER     = "fy ≥"
IDC_DGN_PREF_DRAWING_DWG_STRING_NAME_UNDER    = "fy <"
IDC_DGN_PREF_DRAWING_DWG_FRAME_DESIGN_FORCE   = "標示設計力量"
IDC_DGN_PREF_DRAWING_DWG_FRAME_TYPE_OF_REBAR  = "鋼筋表格型式 (批量牆設計)"
IDC_DGN_PREF_DRAWING_RADIO_BATCHWALL_COMPACT  = "緊密型式"
IDC_DGN_PREF_DRAWING_RADIO_BATCHWALL_SPREAD   = "獨立型式"
IDC_DGN_PREF_DRAWING_DWG_FRAME_NON_SCALED     = "不按比例繪製"
IDC_DGN_PREF_DRAWING_DWG_CHECK_NOSCALE_URBE   = "RC梁"
IDC_DGN_PREF_DRAWING_DWG_CHECK_NOSCALE_URBU   = "RC扶壁"
IDC_DGN_PREF_DRAWING_DWG_CHECK_NOSCALE_URCO   = "RC柱"

IDS_DGN_DWG_BARNAME_NOT_EXIST                 = "Rebar Name Data is NOT Exist."
IDS_DGN_DWG_BARNAME_INVALID_DATA              = "Rebar Name Data has invalid Material or Empty Symbol."
IDS_DGN_DWG_BARNAME_DUPLICATE_DATA            = "Rebar Name Data has duplicated."
IDS_DGN_DWG_BARNAME_UNSORTED_DATA             = "Rebar Name Data is NOT Sorted."

//// IDD_DGN_PREF_DRAWING_FILE_DLG
IDC_DGN_PREF_DRAWING_FRAME_FILE               = "圖框檔案"
IDC_DGN_PREF_DRAWING_FRAME_LEGEND_FILE        = "圖例檔案"
IDC_DGN_PREF_BTN_DEFAULT_DRAWING_FILE         = "回復預設值"
IDC_DGN_PREF_DRAWING_SYSTEM                   = "構造系統"
IDC_DGN_PREF_DRAWING_SYSTEM2                  = "構造系統"

//////// IDD_DGN_PREF_DRAWING_LAYER_DLG
IDC_DGN_DRAW_LAYER_FRAME_COMMON_ITEM          = "一般項目"
IDC_DGN_DRAW_LAYER_COMM_LIST                  = "List1"
IDC_DGN_DRAW_LAYER_FRAME_SYSTEM_ITEM          = "構造系統項目"
IDC_DGN_DRAW_LAYER_SYST_LIST                  = "List1"
IDC_DGN_PREF_BTN_DEFAULT_DRAWING_LAYER        = "回復預設值"
IDC_DGN_DRAW_LAYER_LABEL_SYSTEM               = "構造系統"
IDC_DGN_DRAW_LAYER_LABEL_MEMBER               = "構件"

////// IDD_DGN_BAR_TABLE_DLG
IDD_DGN_BAR_TABLE_DLG                         = "鋼筋表格"
IDC_BARTABLE_FRAME_CODE                       = "規範"
IDC_BARTABLE_FRAME_SPACE                      = "間距/數量"
IDC_BARTABLE_RADIO_BY_SPACE                   = "依間距"
IDC_BARTABLE_RADIO_BY_NUMBER                  = "依數量"
IDC_BARTABLE_BTN_ADD                          = "新增"
IDC_BARTABLE_BTN_ADD1                         = "新增"
IDC_BARTABLE_BTN_DEL                          = "刪除"
IDC_BARTABLE_BTN_SORT                         = "排序"
IDC_BARTABLE_FRAME_OPTION                     = "選項"
IDC_BARTABLE_CHECK_DOULBE                     = "雙層筋配置"
IDC_BARTABLE_BTN_DEFAULT                      = "回復預設"
IDC_BARTABLE_BTN_EXPORT                       = "匯出"
IDC_BARTABLE_BTN_CALC                         = "計算"
IDC_QUANTITY_LABEL_STORY                      = "至"
IDC_BARTABLE_STATIC_CODE                      = "規範"
IDC_BARTABLE_STATIC_TYPE                      = "號數"
IDC_BARTABLE_STATIC_FROM                      = "從"
IDC_BARTABLE_STATIC_TO                        = "至"
IDC_BARTABLE_STATIC_STEP                      = "間隔"
IDC_BARTABLE_STATIC_WAVE                      = "~"
IDC_QUANTITY_LABEL_COLNO                      = "資料欄數"

////// IDD_DGN_BAR_INFO_DLG
IDD_DGN_BAR_INFO_DLG                          = "鋼筋資料"
IDC_BARINFO_LBL_CODE                          = "鋼筋規範"
IDS_DGN_BARINFO_NAME                          = "名稱"
IDS_DGN_BARINFO_DIAM                          = "直徑"
IDS_DGN_BARINFO_AREA                          = "斷面積"
IDS_DGN_BARINFO_DIAO                          = "外徑"
IDS_DGN_BARINFO_WGHT                          = "單位重"

////// IDD_DGN_PERFORM_DESIGN_DLG
IDD_DGN_PERFORM_DESIGN_DLG                    = "執行基本設計"

////// IDD_DGN_SECT_INFO_DLG
IDD_DGN_SECT_INFO_DLG                         = "型鋼斷面資料"
IDC_SECTINFO_LBL_CODE                         = "斷面規範"
IDC_SECTINFO_LBL_SHAP                         = "斷面形狀"
IDC_SECTINFO_LBL_TYPE                         = "斷面形式"
IDC_SECTINFO_LBL_PLCS                         = "設定小數點位數"
IDC_SECTINFO_BTN_PLCS                         = "設定小數點位數..."
IDC_SECTINFO_FRM_SECT                         = "斷面資料"
IDC_SECTINFO_FRM_OPTN                         = "表格選項"
IDS_DGN_SECTINFO_NAME                         = "斷面名稱"
IDC_SECTINFO_BTN_WDTH                         = "調整欄寬"
IDC_SECTINFO_CHK_USER                         = "Calc. as User Section"

////// IDD_DGN_SECT_INFO_DEC_DLG
IDD_DGN_SECT_INFO_DEC_DLG                     = "設定小數點位數"
IDC_SECTINFO_DEC_FRM_PLCS                     = "小數點位數"
IDC_SECTINFO_DEC_LBL_SECT                     = "斷面尺寸"
IDC_SECTINFO_DEC_LBL_AREA                     = "面積"
IDC_SECTINFO_DEC_LBL_WGHT                     = "單位重"
IDC_SECTINFO_DEC_LBL_INER                     = "慣性矩"
IDC_SECTINFO_DEC_LBL_MDLS                     = "斷面模數"
IDC_SECTINFO_DEC_LBL_GRTN                     = "迴轉半徑"
IDC_SECTINFO_DEC_LBL_TORS                     = "扭轉常數"
IDC_SECTINFO_DEC_LBL_WARP                     = "翹曲常數"

//////IDD_DGN_BATCH_DESIGN
IDD_DGN_BATCH_DESIGN                          = "批次設計"
IDC_DGN_BD_FRAME_RC                           = "RC造"
IDC_DGN_BD_FRAME_SRC                          = "SRC造"
IDC_DGN_BD_FRAME_ALU                          = "鋁構造"
IDC_DGN_BD_FRAME_RFM                          = "構件補強"
IDC_DGN_BD_RC_SLAB_CHK                        = "樓版"
IDC_DGN_BD_RC_BEAM_CHK                        = "梁"
IDC_DGN_BD_RC_COLM_CHK                        = "柱"
IDC_DGN_BD_RC_GCOL_CHK                        = "柱 (任意斷面)"
IDC_DGN_BD_RC_SWAL_CHK                        = "剪力牆"
IDC_DGN_BD_RC_GWAL_CHK                        = "剪力牆 (組合牆)"
IDC_DGN_BD_RC_FOOT_CHK                        = "基礎"
IDC_DGN_BD_RC_RRCF_CHK                        = "基礎 (聯合)"
IDC_DGN_BD_RC_CBSF_CHK                        = "基礎 (連續)"
IDC_DGN_BD_RC_BWAL_CHK                        = "地下室外牆"
IDC_DGN_BD_RC_BUTT_CHK                        = "扶壁"
IDC_DGN_BD_RC_STAI_CHK                        = "樓梯"
IDC_DGN_BD_RC_CORB_CHK                        = "托梁/托架"
IDC_DGN_BD_RC_URRW_CHK                        = "擋土牆"
IDC_DGN_BD_RC_BELT_CHK                        = "梁表格"
IDC_DGN_BD_RC_SLLT_CHK                        = "樓版表格"
IDC_DGN_BD_FRAME_STEEL                        = "鋼構造"
IDC_DGN_BD_ST_BNCO_CHK                        = "梁&&柱"
IDC_DGN_BD_ST_BOCO_CHK                        = "螺栓接合"
IDC_DGN_BD_ST_BAPL_CHK                        = "基座板"
IDC_DGN_BD_ST_CRAN_CHK                        = "天車梁"
IDC_DGN_BD_ST_PURL_CHK                        = "桁條&&圍梁"
IDC_DGN_BD_ST_WEBO_CHK                        = "腹板開孔"
IDC_DGN_BD_ST_STAI_CHK                        = "鋼製樓梯"
IDC_DGN_BD_ST_WELD_CHK                        = "銲接"
IDC_DGN_BD_ST_EMBP_CHK                        = "預埋板"
IDC_DGN_BD_SR_COMP_CHK                        = "合成梁"
IDC_DGN_BD_SR_COLM_CHK                        = "柱"
IDC_DGN_BD_SR_CFTC_CHK                        = "CFT柱"
IDC_DGN_BD_SR_BASE_CHK                        = "基座板"
IDC_DGN_BD_AL_BEAM_CHK                        = "梁&&柱"
IDC_DGN_BD_AL_MULI_CHK                        = "梁&&柱 (任意斷面)"
IDC_DGN_BATCHDGN_BTN_SELECT_ALL               = "全選..."
IDC_DGN_BATCHDGN_BTN_SELECT_NONE              = "全不選..."
IDC_DGN_BATCHDGN_BTN_CLOSE                    = "關閉"
IDC_DGN_BATCHDGN_PROG                         = "Progress1"

/// IDD_DGN_BATCH_PRINT_DLG
IDD_DGN_BATCH_PRINT_DLG                       = "批次列印"
IDC_BPRINT_FRAME_DWG                          = "圖檔"
IDC_BPRINT_CHK_DWG                            = "設計圖檔"
IDC_BPRINT_FRAME_QUICK                        = "報表"
IDC_BPRINT_CHK_DETAIL                         = "詳細計算"
IDC_BPRINT_CHK_SUMMARY                        = "設計摘要"
IDC_BPRINT_CHK_INPUT                          = "計算參數"
IDC_BPRINT_FRAME_CONTENT                      = "報表內容"
IDC_BPRINT_FRAME_SELECT_MEMB                  = "選擇要匯出的構件"
IDC_BPRINT_BTN_SELECT_ALL                     = "全選"
IDC_BPRINT_BTN_UNSELECT_ALL                   = "全不選"
IDC_BPRINT_BTN_PRINT                          = "列印"
IDC_BPRINT_BTN_CLOSE                          = "關閉"

///// IDD_DGN_CHECK_MODE_DLG
IDC_DGN_REPORT_BTN_PRINT                      = "列印..."
IDC_DGN_REPORT_BTN_SAVE                       = "儲存..."
IDC_DGN_REPORT_BTN_RPRT                       = "報表..."
IDC_DGN_REPORT_BTN_OPTN                       = "選項..."
IDC_DGN_REPORT_RADIO_DET                      = "詳細計算"
IDC_DGN_REPORT_RADIO_SUM                      = "設計摘要"
IDC_DGN_REPORT_CHECK_INP                      = "包含設計參數資料"
IDC_DGN_REPORT_VIEW                           = "Report View"
IDC_DGN_REPORT_ZOOM_SCALE                     = "Zoom Scale"
IDC_DGN_REPORT_CONTENT_TYPE                   = "Content Type"

////// IDD_DGN_CHECK_OPT_DLG
IDD_DGN_CHECK_OPT_DLG                         = "檢核選項"
IDC_DGN_CHKOP_BTN_CLOSE                       = "&關閉"
IDC_DGN_CHKOP_BTN_DEFAULT                     = "&回復預設值"

//// IDD_DGN_CHECK_OPT_RCS_DLG
IDC_DGN_CHKOP_CHK_SLAB_LOAD                   = "檢核設計載重 (活載重 ≤ %d x 靜載重)"
IDC_DGN_CHKOP_CHK_URBE_SPACE                  = "依裂縫控制檢核鋼筋間距"
IDC_DGN_CHKOP_CHK_URBW_SPACE                  = "依裂縫控制檢核鋼筋間距 (單向牆)"
IDC_DGN_CHKOP_CHK_URBU_SPACE                  = "依裂縫控制檢核鋼筋間距"
IDC_DGN_CHKOP_FRAME_SLAB                      = "樓版"
IDC_DGN_CHKOP_FRAME_BEAM                      = "梁"
IDC_DGN_CHKOP_FRAME_BASEMEMT                  = "地下室外牆"
IDC_DGN_CHKOP_FRAME_BUTTRESS                  = "扶壁"
IDC_DGN_CHKOP_CHK_SLAB_SPACE                  = "依裂縫控制檢核鋼筋間距 (單向版)"
IDC_DGN_CHKOP_CHK_URST_SPACE                  = "依裂縫控制檢核鋼筋間距"
IDC_DGN_CHKOP_FRAME_STAIR                     = "樓梯"

//// IDD_DGN_CHECK_OPT_RBS_DLG
IDD_DGN_CHECK_OPT_RBS_DLG                     = "鋼筋間距"
IDC_DGN_CHKOP_RBSP_CHK_RBSP                   = "依材料強度檢核鋼筋間距"

////// IDD_DGN_PREF_DESIGN_DLG
IDC_DGN_PREF_BTN_DEFAULT_DESIGN               = "回復預設值"

///// IDD_DGN_PREF_DESIGN_RC1_DLG
IDC_DGN_PREF_DESIGN_FRAME_SLAB                = "樓版"
IDC_DGN_PREF_DESIGN_CHECK_GSLAB               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GSLAB_T             = "最大厚度"
IDC_DGN_PREF_DESIGN_FRAME_COLUMN              = "柱"
IDC_DGN_PREF_DESIGN_CHECK_GURCO               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_B             = "最大寬度"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_D             = "最大高度"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_R             = "最大鋼筋比"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_GEN           = "使用Gen/ADS的設計方法"
IDC_DGN_PREF_DESIGN_FRAME_BASEMENTWALL        = "地下室外牆"
IDC_DGN_PREF_DESIGN_CHECK_GURBW               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GURBW_T             = "最大厚度"
IDC_DGN_PREF_DESIGN_CHECK_GURBW_SHEAR         = "使用剪力筋"
IDC_DGN_PREF_DESIGN_FRAME_FOOTING             = "基礎"
IDC_DGN_PREF_DESIGN_CHECK_GUFDN               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GUFDN_T             = "最大厚度"
IDC_DGN_PREF_DESIGN_LABEL_GUCBF               = "聯合基礎"
IDC_DGN_PREF_DESIGN_CHECK_GUCBF               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GUCBF_T             = "最大厚度"
IDC_DGN_PREF_DESIGN_FRAME_STAIR               = "樓梯"
IDC_DGN_PREF_DESIGN_CHECK_GURST               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GURST_T             = "最大厚度"
IDC_DGN_PREF_DESIGN_FRAME_CORBEL              = "托梁/托架"
IDC_DGN_PREF_DESIGN_CHECK_GURCB               = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_GURCB_B             = "最大寬度"
IDC_DGN_PREF_DESIGN_CHECK_GURCB_D             = "最大高度"
IDC_DGN_PREF_DESIGN_LABEL_GURBW_REBAR         = "鋼筋"
IDC_DGN_PREF_DESIGN_LABEL_GURBW_REBAR2        = "~"
IDC_DGN_PREF_DESIGN_LABEL_GURCO_R             = "%"

/////// IDD_DGN_PREF_DESIGN_RC2_DLG
IDC_DGN_PREF_DESIGN_FRAME_BEAM                = "梁"
IDC_DGN_PREF_DESIGN_CHECK_URBE                = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_URBE_B              = "最大寬度"
IDC_DGN_PREF_DESIGN_CHECK_URBE_D              = "最大高度"
IDC_DGN_PREF_DESIGN_CHECK_URBE_LEGNO          = "依寬度決定肢數"
IDC_DGN_PREF_DESIGN_BTN_URBE_ADD              = "新增"
IDC_DGN_PREF_DESIGN_BTN_URBE_INS              = "插入"
IDC_DGN_PREF_DESIGN_BTN_URBE_DEL              = "刪除"
IDC_DGN_PREF_DESIGN_CHECK_URBE_NO             = "最大鋼筋排數"
IDC_DGN_PREF_DESIGN_FRAME_BUTRESS             = "扶壁"
IDC_DGN_PREF_DESIGN_CHECK_URBU                = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_URBU_B              = "最大寬度"
IDC_DGN_PREF_DESIGN_CHECK_URBU_D              = "最大高度"
IDC_DGN_PREF_DESIGN_CHECK_URBU_LEGNO          = "依寬度決定肢數"
IDC_DGN_PREF_DESIGN_BTN_URBU_ADD              = "新增"
IDC_DGN_PREF_DESIGN_BTN_URBU_INS              = "插入"
IDC_DGN_PREF_DESIGN_BTN_URBU_DEL              = "刪除"
IDC_DGN_PREF_DESIGN_CHECK_URBU_NO             = "最大鋼筋排數"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RC2           = "回復預設值"
IDC_DGN_PREF_DESIGN_FRAME_URBE_STIRRUP        = "剪力筋"
IDC_DGN_PREF_DESIGN_LABEL_URBE_BAR            = "鋼筋"
IDC_DGN_PREF_DESIGN_FRAME_URBU_STIRRUP        = "剪力筋"
IDC_DGN_PREF_DESIGN_LABEL_URBU_REBAR          = "鋼筋"

/// IDD_DGN_PREF_DESIGN_RC3_DLG
IDC_DGN_PREF_DESIGN_FRAME_STRIP_FOOTING       = "連續基礎"
IDC_DGN_PREF_DESIGN_CHECK_URSF                = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_URSF_B              = "最大寬度"
IDC_DGN_PREF_DESIGN_CHECK_URSF_D              = "最大高度"
IDC_DGN_PREF_DESIGN_CHECK_URSF_LEGNO          = "依寬度決定肢數"
IDC_DGN_PREF_DESIGN_BTN_URSF_ADD              = "新增"
IDC_DGN_PREF_DESIGN_BTN_URSF_INS              = "插入"
IDC_DGN_PREF_DESIGN_BTN_URSF_DEL              = "刪除"
IDC_DGN_PREF_DESIGN_CHECK_URSF_NO             = "最大鋼筋排數"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RC3           = "回復預設值"
IDC_DGN_PREF_DESIGN_FRAME_URSF_STIRRUP        = "剪力筋"

/// IDD_DGN_PREF_DESIGN_RFM_DLG
IDC_DGN_PREF_DESIGN_FRAME_UFSL                = "樓版"
IDC_DGN_PREF_DESIGN_CHECK_UFSL                = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_UFSL_B              = ""最大尺寸
IDC_DGN_PREF_DESIGN_CHECK_UFSL_NO             = "最大補強件數量"
IDC_DGN_PREF_DESIGN_FRAME_UFBE                = "梁"
IDC_DGN_PREF_DESIGN_CHECK_UFBE                = "依設計結果變更斷面"
IDC_DGN_PREF_DESIGN_CHECK_UFBE_B              = "最大尺寸"
IDC_DGN_PREF_DESIGN_CHECK_UFBE_NO             = "最大補強件數量"
IDC_DGN_PREF_DESIGN_FRAME_UFCO                = "柱"
IDC_DGN_PREF_DESIGN_CHECK_UFCO_NO             = "最大補強件數量"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RFM           = "回復預設值"

/////// IDD_DGN_PREF_WORD_DLG
IDS_DGN_WORD_STYLE_NAME                       = "名稱"
IDS_DGN_WORD_STYLE_FONT_NAME                  = "字型"
IDS_DGN_WORD_STYLE_FONT_SIZE                  = "字體大小"
IDS_DGN_WORD_STYLE_FONT_COLOR                 = "顏色"
IDS_DGN_WORD_STYLE_FONT_BOLD                  = "粗體"
IDS_DGN_WORD_STYLE_FONT_ITALIC                = "斜體"
IDS_DGN_WORD_STYLE_FONT_UNDERLINE             = "底線"

////// IDD_DGN_LINK_DATABASE_DLG
IDD_DGN_LINK_DATABASE_DLG                     = "Link DataBase"

////// IDD_DGN_LINK_OPTION_DLG
IDD_DGN_LINK_OPTION_DLG                       = "Link選項"
IDC_LINK_TYPE_TEXT                            = "Link型式"
IDC_LINK_OPT_RADIO_SECTION                    = "依斷面匯入"
IDC_LINK_OPT_RADIO_MEMBER                     = "依構件匯入"
IDC_LINK_OPT_CHECK_SECTION                    = "不同材料性質者採分別匯入"
IDC_LINK_OPT_BTN_DEFAULT                      = "回復預設值"
IDC_LINK_OPT_BTN_OK                           = "&確認"
IDC_LINK_OPT_BTN_APPLY                        = "&套用"
IDC_LINK_OPT_BTN_CANCEL                       = "&取消"

////// IDD_DGN_LINK_OPTION_ALU_DLG
IDC_LINK_OPT_TXT_GUAAG                        = "梁/柱"
IDC_LINK_OPT_TXT_GUAMT                        = "梁/柱 (任意斷面)"

////// IDD_DGN_LINK_OPTION_NAME_DLG
IDC_FORMAT_TEXT                               = "名稱格式 : "
IDC_FORMAT__S                                 = "%S : 斷面名稱"
IDC_FORMAT__N                                 = "%N : 桿件/節點編號"
IDC_FORMAT__F                                 = "%F : 樓層名稱"
IDC_FORMAT__M                                 = "%M : 材料名稱"
IDC_LINK_OPT_CHECK_NAME                       = "移除樓層名稱字元"
IDC_LINK_OPT_TXT_ABOVE                        = "基面以上 : "
IDC_LINK_OPT_TXT_BELOW                        = "基面以下 : "

////// IDD_DGN_LINK_OPTION_RCS_DLG
IDC_LINK_OPT_TXT_GURBE                        = "梁"
IDC_LINK_OPT_TXT_GURCO                        = "柱"
IDC_LINK_OPT_TXT_GURGC                        = "柱 (任意斷面)"
IDC_LINK_OPT_TXT_GURSW                        = "剪力牆"
IDC_LINK_OPT_TXT_GURDW                        = "組合牆"
IDC_LINK_OPT_TXT_GUFDN                        = "基礎"
IDC_LINK_OPT_TXT_GURSF                        = "連續基礎"
IDC_LINK_OPT_TXT_GURCF                        = "聯合基礎"

IDS_LINK_OPT_TAB_LINK_DATA                    = "Down Link"
IDS_LINK_OPT_TAB_UPLINK_DATA                  = "Up Link"
IDS_LINK_OPT_TAB_MEMBER_DATA                  = "Memb.( Down Link )"
IDS_LINK_OPT_TAB_MEMBER_DATA_UP               = "Memb.( Up Link )"
IDS_LINK_OPT_LINK_SETTING                     = "連結設定"
IDS_LINK_OPT_LINK_TYPE_MEMB                   = "連結方式"
IDS_LINK_OPT_LINK_APPLY_LINK_BY_MEMBER        = "依斷面/構件資料分類"
IDS_LINK_OPT_LINK_BY_SECTION                  = "依斷面設定分別匯入"
IDS_LINK_OPT_LINK_BY_MEMBER                   = "依構件設定各自匯入"
IDS_LINK_OPT_LINK_CONSIDER_MATL               = "使用不同材料者將分別匯入"
IDS_LINK_OPT_LINK_LCOM_TYPE                   = "載重組合"
IDS_LINK_OPT_LINK_LCOM_REMO                   = "移除重複出現之載重組合"
IDS_LINK_OPT_LINK_FORC_TYPE                   = "外力類型"
IDS_LINK_OPT_TXT_FORCE_TYPE                   = "外力類型"
IDS_LINK_OPT_LINK_DESIGN_FORCE_TYPE           = "設計外力類型"

////// IDD_DGN_LINK_OPTION_SRC_DLG
IDC_LINK_OPT_TXT_GUCCO                        = "柱"
IDC_LINK_OPT_TXT_GUCFT                        = "CFT柱"
IDC_LINK_OPT_TXT_GUCBP                        = "基座板"

////// IDD_DGN_LINK_OPTION_STL_DLG
IDC_LINK_OPT_TXT_GUSSG                        = "梁/柱"
IDC_LINK_OPT_TXT_GUSBC                        = "螺栓接合"
IDC_LINK_OPT_TXT_GUSBP                        = "基座板"
IDC_LINK_OPT_TXT_GUSWE                        = "銲接"
IDC_LINK_OPT_TXT_GUSWE_POS                    = "位置"
IDC_LINK_OPT_TXT_GUSEP                        = "預埋板"
IDC_LINK_OPT_TXT_GESBC_TYPE                   = "類型"
IDC_LINK_OPT_TXT_GESMC                        = "彎矩螺栓接合"

////// IDD_DGN_LINK_OPTION_RFM_DLG
IDC_LINK_OPT_TXT_GUFBE                        = "梁"
IDC_LINK_OPT_TXT_GUFCO                        = "柱"

////// IDD_DGN_UPLINK_OPTN_LINK_DLG
IDC_DGN_FRM_LINK_DATA                         = "Link Data"
IDC_DGN_CHK_DATA_SECT                         = "Change Section ( Beam / Column / Brace )"
IDC_DGN_RDO_SECT_ANAL                         = "by Section for Analysis"
IDC_DGN_RDO_SECT_DSGN                         = "by Section for Design"
IDC_DGN_CHK_DATA_THCK                         = "Change Thickness ( Wall )"
IDC_DGN_RDO_THCK_ANAL                         = "by Thickness for Analysis"
IDC_DGN_RDO_THCK_DSGN                         = "by Thickness for Design"
IDC_DGN_CHK_DATA_MATL                         = "Change Material"
IDC_DGN_RDO_MATL_ANAL                         = "by Material for Analysis"
IDC_DGN_RDO_MATL_DSGN                         = "by Material for Design"
IDC_DGN_CHK_DATA_RBAR                         = "Change Rebar Arrangement"

////// IDD_DGN_LIST_SOIL_DLG
IDD_DGN_LIST_SOIL_DLG                         = "土層性質"
IDD_DGN_LIST_SOIL_DLG_STATIC                  = "Soil Properties ( Static Load )"
IDD_DGN_LIST_SOIL_DLG_SEISMIC                 = "Soil Properties ( Seismic Load )"
IDC_DGN_SELECT_MEMBER_GRID_TEXT               = "選擇構件"
IDC_DGN_SELECT_BTN_ALL                        = "全選"
IDC_DGN_SELECT_BTN_NONE                       = "全不選"
IDC_DGN_SOIL_CHK_TEXT                         = "土層性質"
IDC_DGN_SOIL_CHK_VALUE                        = "使用N值"
IDC_DGN_SOIL_CHK_PRESSURE                     = "使用主動土壓"
IDC_DGN_SOIL_CHK_KH                           = "Use User Defined KH"
IDC_DGN_SOIL_BTN_ADD                          = "新增"
IDC_DGN_SOIL_BTN_DEL                          = "刪除"
IDC_DGN_SOIL_BTN_INS                          = "插入"
IDC_DGN_SOIL_BTN_APPLY                        = "套用"
IDC_DGN_SOIL_BTN_CANCEL                       = "取消"
IDC_DGN_SOIL_PROPER_FRM                       = "土層性質"
IDC_DGN_SOIL_BTN_GET_LOAD                     = "Get Data from Static Pressure Load"
IDC_DGN_SOIL_BTN_GET_STATIC                   = "Get Data from Static Pressure Load"
IDC_DGN_SOIL_BTN_GET_SEISMIC                  = "Get Data from Seismic Pressure Load"
IDC_DGN_SOIL_BTN_GET_MEMB                     = "Get Data from Member Data ..."

////// IDD_DGN_LIST_USER_DLG
IDD_DGN_LIST_USER_DLG                         = "土壤載重"
IDC_DGN_SELECT_MEMB_TEXT                      = "選擇構件"
IDC_DGN_USER_SOIL_FORCE_TEXT                  = "土壤載重"
IDC_DGN_USER_BTN_ADD                          = "新增"
IDC_DGN_USER_BTN_DEL                          = "刪除"
IDC_DGN_USER_BTN_INS                          = "插入"
IDC_DGN_USER_BTN_APPLY                        = "套用"
IDC_DGN_USER_BTN_CANCEL                       = "取消"

/////// IDD_DGN_OPT_RAT_DLG
IDC_DGN_OPTION_TARGET_RATIO                   = "Ratio"
IDC_DGN_OPTION_SET_TARGET_RATIO_BY_MEMBER     = "※ 依構件類型設定最大應力比"
IDC_DGN_OPTION_BY_N_MEMBER                    = "By\nMember"
IDC_DGN_OPTION_COMP_N_DESIGN                  = "Comp.\nDesign"
IDC_DGN_OPTION_TENS_N_DESIGN                  = "Tens.\nDesign"
IDC_DGN_OPTION_BEND_N_DESIGN                  = "Bending\nDesign"
IDC_DGN_OPTION_SHEAR_N_DESIGN                 = "Shear\nDesign"
IDC_DGN_OPTION_OTHER_N_DESIGN                 = "Etc.\nDesign"

////// IDD_DGN_OPT_ALU_DLG
IDC_OPTION_ALU_COMBO_DESIGN_CODE_TEXT         = "設計規範"
IDC_OPTION_ALU_TARGET_RATIO_TEXT              = "設計檢核比值上限"
IDC_OPTION_ALU_COMBO_RATIO_BENDING_TEXT       = "撓曲"
IDC_OPTION_ALU_COMBO_RATIO_COMP_TEXT          = "壓力"
IDC_OPTION_ALU_COMBO_RATIO_TENSION_TEXT       = "拉力"
IDC_OPTION_ALU_COMBO_RATIO_SHEAR_TEXT         = "剪力&&扭力"
IDC_OPTION_ALU_COMBO_RATIO_OTHERS_TEXT        = "其他"

////// IDD_DGN_OPT_CFS_DLG
IDC_OPTION_CFS_COMBO_DESIGN_CODE_TEXT         = "設計規範"
IDC_OPTION_CFS_TARGET_RATIO_TEXT              = "設計檢核比值上限"
IDC_OPTION_CFS_COMBO_RATIO_BENDING_TEXT       = "撓曲"
IDC_OPTION_CFS_COMBO_RATIO_COMP_TEXT          = "壓力"
IDC_OPTION_CFS_COMBO_RATIO_TENSION_TEXT       = "拉力"
IDC_OPTION_CFS_COMBO_RATIO_SHEAR_TEXT         = "剪力&&扭力"
IDC_OPTION_CFS_COMBO_RATIO_OTHERS_TEXT        = "其他"

////// IDD_DGN_CODE_TABLE_DLG
IDD_DGN_CODE_TABLE_DLG                        = "Design Code Table"

////// IDD_DGN_CODE_DLG
IDD_DGN_CODE_DLG                              = "Design Code"
IDC_GUOPT_FRAME_DGN_CODE                      = "Design Code"
IDC_GUOPT_FRAME_LOADCODE                      = "設計載重"
IDC_GUOPT_COMBO_LOAD_WIND_TEXT                = "風載重"
IDC_GUOPT_COMBO_LOAD_SNOW_TEXT                = "雪載重"
IDC_GUOPT_TAB_OPTION_TEXT                     = "設計選項"
IDC_GUOPT_BTN_APPLY                           = "套用"
IDC_GUOPT_BTN_CLOSE                           = "關閉"
IDC_GUOPT_BTN_APPLY                           = "套用"
IDC_GUOPT_BTN_CLOSE                           = "關閉"

////// IDD_DGN_DATABASE_DLG
IDD_DGN_DATABASE_DLG                          = "Data Base"
IDC_GUOPT_FRAME_UNIT_SYSTEM                   = "單位"
IDC_USER_UNIT_RADIO                           = "自定義"
IDC_SYSTEM_UNIT_RADIO                         = "單位系統"
IDC_GUOPT_UNIT_SYSTEM_TEXT                    = "單位："
IDC_GUOPT_FRAME_STL_DB                        = "鋼構材資料庫"
IDC_GUOPT_STL_DB_MATERIAL                     = "材料"
IDC_GUOPT_STL_DB_SECTION                      = "斷面"
IDC_GUOPT_FRAME_ALU_DB                        = "鋁構材資料庫"
IDC_GUOPT_ALU_DB_MATERIAL                     = "材料"
IDC_GUOPT_ALU_DB_SECTION                      = "斷面"
IDC_GUOPT_FRAME_RFM_DB                        = "補強材料資料庫"
IDC_GUOPT_RFM_DB_MATL_FRP                     = "材料 (FRP)"
IDC_GUOPT_RFM_DB_MATL_STL                     = "材料 (Steel)"

////// IDD_DGN_OPT_RCS_DLG
IDC_OPTION_RCS_COMBO_DESIGN_CODE_TEXT         = "設計規範"
IDC_OPTION_RCS_TARGET_RATIO_TEXT              = "設計檢核比值上限"
IDC_OPTION_RCS_COMBO_RATIO_BENDING_TEXT       = "撓曲"
IDC_OPTION_RCS_COMBO_RATIO_COMP_TEXT          = "壓力"
IDC_OPTION_RCS_COMBO_RATIO_TENSION_TEXT       = "拉力"
IDC_OPTION_RCS_COMBO_RATIO_SHEAR_TEXT         = "剪力&&扭力"
IDC_OPTION_RCS_COMBO_RATIO_OTHERS_TEXT        = "其他"

////// IDD_DGN_OPT_RCS_ADD_DLG
IDD_DGN_OPT_RCS_ADD_DLG                       = "額外設計資訊"
IDC_OPTION_RCS_DGNCODE_TEXT                   = "設計規範 : "
IDC_OPTION_RCS_PARTIAL_FACTOR_TEXT            = "部分安全因數"
IDC_OPTION_RCS_EDT_FACTOR_GAMMAC_TEXT         = "混凝土 ( γc )"
IDC_OPTION_RCS_EDT_FACTOR_GAMMAS_TEXT         = "鋼構 ( γs )"
IDC_OPTION_RCS_EDT_FACTOR_ALPHACC_TEXT        = "αcc"
IDC_OPTION_RCS_DELTA_FACTOR_TEXT              = "Etc"
IDC_OPTION_RCS_EDT_FACTOR_DELTA_TEXT          = "再分配率 ( δ )"

////// IDD_DGN_OPT_STL_DLG
IDC_OPTION_STEEL_COMBO_DESIGN_CODE_TEXT       = "設計規範"
IDC_OPTION_STEEL_TARGET_RATIO_TEXT            = "設計檢核比值上限"
IDC_OPTION_STEEL_COMBO_RATIO_BENDING_TEXT     = "撓曲"
IDC_OPTION_STEEL_COMBO_RATIO_COMP_TEXT        = "壓力"
IDC_OPTION_STEEL_COMBO_RATIO_TENSION_TEXT     = "拉力"
IDC_OPTION_STEEL_COMBO_RATIO_SHEAR_TEXT       = "剪力&&扭力"
IDC_OPTION_STEEL_COMBO_RATIO_OTHERS_TEXT      = "其他"

/////// IDD_DGN_OPT_STL_ADD_DLG
IDD_DGN_OPT_STL_ADD_DLG                       = "額外設計資訊"
IDC_OPTION_STL_DGNCODE_TEXT                   = "設計規範 : "
IDC_OPTION_STL_PARTIAL_FACTOR_TEXT            = "部分安全因數"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM0_TEXT        = "γM0"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM1_TEXT        = "γM1"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM2_C_TEXT      = "γM2 (橫斷面) "
IDC_OPTION_STL_EDT_FACTOR_GAMMAM2_TEXT        = "γM2 (螺栓, 銲接) "
IDC_OPTION_STL_EDT_FACTOR_GAMMAMU_TEXT2       = "γMu"
IDC_OPTION_STL_EDT_FACTOR_ETA_TEXT3           = "ŋ"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM0_TEXT2       = "βj(基礎聯合材料)"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM1_TEXT2       = "√(Ac1/Ac0)"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM2_C_TEXT2     = "基座板與無收縮砂漿之摩擦力"
IDC_DGN_OPT_STL_ADD_OK                        = "確認"
IDC_DGN_OPT_STL_ADD_CANCEL                    = "取消"

////// IDD_DGN_OPT_SRC_DLG
IDC_OPTION_SRC_COMBO_DESIGN_CODE_TEXT         = "設計規範"
IDC_OPTION_SRC_TARGET_RATIO_TEXT              = "設計檢核比值上限"
IDC_OPTION_SRC_COMBO_RATIO_BENDING_TEXT       = "撓曲"
IDC_OPTION_SRC_COMBO_RATIO_COMP_TEXT          = "壓力"
IDC_OPTION_SRC_COMBO_RATIO_TENSION_TEXT       = "拉力"
IDC_OPTION_SRC_COMBO_RATIO_SHEAR_TEXT         = "剪力&&扭力"
IDC_OPTION_SRC_COMBO_RATIO_OTHERS_TEXT        = "其他"

/////// IDD_DGN_OPT_SRC_ADD_DLG
IDD_DGN_OPT_SRC_ADD_DLG                       = "額外設計資訊"

////// IDD_DGN_OPT_RFM_DLG
IDC_OPTION_RFM_COMBO_DESIGN_CODE_TEXT         = "設計規範"
IDC_OPTION_RFM_TARGET_RATIO_TEXT              = "設計檢核比值上限"
IDC_OPTION_RFM_COMBO_RATIO_BENDING_TEXT       = "撓曲"
IDC_OPTION_RFM_COMBO_RATIO_COMP_TEXT          = "壓力"
IDC_OPTION_RFM_COMBO_RATIO_TENSION_TEXT       = "拉力"
IDC_OPTION_RFM_COMBO_RATIO_SHEAR_TEXT         = "剪力&&扭力"
IDC_OPTION_RFM_COMBO_RATIO_OTHERS_TEXT        = "其他"

////// IDD_DGN_CONVERT_DLG
IDD_DGN_CONVERT_DLG                           = "轉換為SRC柱"
IDC_CONVERT_FRAME                             = "選擇構件"
IDC_CONVERT_BTN_SELALL                        = "全選"
IDC_CONVERT_BTN_INVERT                        = "反選"
IDC_CONVERT_BTN_SELNON                        = "全不選"
IDC_CONVERT_BTN_CONVERT                       = "轉換"
IDC_CONVERT_BTN_CLOSE                         = "關閉"

////// IDD_DGN_DECK_SECT_DLG
IDC_DGN_CHK_USE                               = "使用鋼承板"
IDC_DGN_LABEL_DECK                            = "斷面"
IDC_DGN_LABEL_DIRECT                          = "方向"
IDD_DGN_DECK_PROP_DLG                         = "Deck Properties"

////// IDD_DGN_EXPORT_ALU_DLG
IDC_EXPORT_ALU_BTN_ALL                        = "全選"
IDC_EXPORT_ALU_BTN_NONE                       = "全不選"

////// IDD_DGN_EXPORT_DLG
IDD_DGN_EXPORT_DLG                            = "匯出檔案"
IDC_EXPORT_FRAME_FILE                         = "匯出至資料夾"
IDC_EXPORT_FRAME_DRAWING                      = "DWG圖檔"
IDC_EXPORT_DWG_CHK                            = "設計圖檔 (*.dwg)"
IDC_EXPORT_FRAME_WORD                         = "Word報表"
IDC_EXPORT_CHK_WORD_DETAIL                    = "詳細計算"
IDC_EXPORT_CHK_WORD_SUMMARY                   = "設計摘要"
IDC_EXPORT_CHK_WORD_INPUT                     = "計算參數"
IDC_EXPORT_FRAME_QUICK                        = "圖檔報表:"
IDC_EXPORT_CHK_QUICK_BMP                      = "BMP"
IDC_EXPORT_CHK_QUICK_EMF                      = "EMF"
IDC_EXPORT_CHK_QUICK_JPG                      = "JPG"
IDC_EXPORT_CHK_QUICK_DETAIL                   = "詳細計算"
IDC_EXPORT_CHK_QUICK_SUMMARY                  = "設計摘要"
IDC_EXPORT_CHK_QUICK_INPUT                    = "計算參數"
IDC_BPRINT_TEXT                               = "報表內容"
IDC_BPRINT_PROJECT_RDO                        = "專案模式"
IDC_BPRINT_SIMPLE_RDO                         = "簡易模式"
IDC_EXPORT_MEMBER_TAB_TEXT                    = "選擇要匯出的構件"
IDC_EXPORT_BTN_SELECT_ALL                     = "全選"
IDC_EXPORT_BTN_UNSELECT_ALL                   = "全不選"
IDC_EXPORT_BTN_EXPORT                         = "匯出"
IDC_EXPORT_BTN_CLOSE                          = "關閉"

////// IDD_DGN_EXPORT_ETC_DLG
IDC_EXPORT_ETC_FRAME_LOAD                     = "設計載重"
IDC_EXPORT_ETC_RADIO_RCS                      = "RC造"
IDC_EXPORT_ETC_RADIO_STL                      = "鋼構造"
IDC_EXPORT_ETC_RADIO_SRC                      = "SRC造"
IDC_EXPORT_ETC_RADIO_ALU                      = "鋁構造"
IDC_EXPORT_ETC_LABEL_CODE                     = "設計規範 : "
IDC_EXPORT_ETC_BTN_ALL                        = "全選"
IDC_EXPORT_ETC_BTN_NONE                       = "全不選"

////// IDD_DGN_EXPORT_RCS_DLG
IDC_EXPORT_RCS_BTN_ALL                        = "全選"
IDC_EXPORT_RCS_BTN_NONE                       = "全不選"

////// IDD_DGN_EXPORT_SRC_DLG
IDC_EXPORT_SRC_BTN_ALL                        = "全選"
IDC_EXPORT_SRC_BTN_NONE                       = "全不選"

////// IDD_DGN_EXPORT_STL_DLG
IDC_EXPORT_STL_BTN_ALL                        = "全選"
IDC_EXPORT_STL_BTN_NONE                       = "全不選"

////// IDD_DGN_TORSION_DLG
IDD_DGN_TORSION_DLG                           = "扭力設計資料 ( Open Section )"
IDC_DGN_TORSION_FRM_MEMB                      = "選擇構件"
IDC_DGN_TORSION_BTN_ALL                       = "全選"
IDC_DGN_TORSION_BTN_NON                       = "全不選"
IDC_DGN_TORSION_FRM_CASE                      = "設計條件"
IDC_DGN_TORSION_LBL_CASE                      = "設計條件"
IDC_DGN_TORSION_LBL_SUPL                      = "支承 (左側)"
IDC_DGN_TORSION_LBL_SUPR                      = "支承 (右側)"
IDC_DGN_TORSION_LBL_DESC                      = "描述"
IDC_DGN_TORSION_FRM_FORC                      = "集中載重"
IDC_DGN_TORSION_LBL_POSF                      = "外力施加距離"
IDC_DGN_TORSION_FRM_CHCK                      = "檢核位置"
IDC_DGN_TORSION_CHK_POSI                      = "調整集中載重的位置"
IDC_DGN_TORSION_BTN_ADD                       = "新增"
IDC_DGN_TORSION_BTN_DEL                       = "刪除"
IDC_DGN_TORSION_BTN_INS                       = "插入"
IDC_DGN_TORSION_BTN_DEF                       = "回復預設值"
IDC_DGN_TORSION_BTN_APP                       = "套用"
IDC_DGN_TORSION_BTN_CAN                       = "取消"

////// IDD_DGN_UNITCON_COM1_DLG
IDC_UNITCON_FRM_COM1_TYPE                     = "單位類型"
IDC_UNITCON_BTN_COM1_ENERGY                   = "能量/功"
IDC_UNITCON_BTN_COM1_ENTHALPY                 = "熱焓"
IDC_UNITCON_BTN_COM1_ENTROPY                  = "熱熵"
IDC_UNITCON_BTN_COM1_FORCE                    = "力量/重量"
IDC_UNITCON_BTN_COM1_POWER                    = "功率"
IDC_UNITCON_BTN_COM1_PRESSURE                 = "壓力/應力"
IDC_UNITCON_BTN_COM1_WDENSITY                 = "每單位體積重"
IDC_UNITCON_BTN_COM1_WEIGHT                   = "每單位長度重"
IDC_UNITCON_BTN_COM1_MOMENT                   = "彎矩/扭矩"
IDC_UNITCON_FRM_COM1_UNIT                     = "單位值"

////// IDD_DGN_UNITCON_COM2_DLG
IDC_UNITCON_FRM_COM2_TYPE                     = "單位類型"
IDC_UNITCON_BTN_COM2_ANGLE                    = "角度"
IDC_UNITCON_BTN_COM2_AREA                     = "面積"
IDC_UNITCON_BTN_COM2_DENSITY                  = "密度"
IDC_UNITCON_BTN_COM2_LENGTH                   = "長度"
IDC_UNITCON_BTN_COM2_MASS                     = "質量"
IDC_UNITCON_BTN_COM2_VOLUME                   = "體積"
IDC_UNITCON_BTN_COM2_VELOCITY                 = "速度/速率"
IDC_UNITCON_BTN_COM2_TIME                     = "時間"

////// IDD_DGN_UNITCON_DLG
IDD_DGN_UNITCON_DLG                           = "單位轉換器"
IDC_DGN_UNITCON_SLIDE_TEXT                    = "視窗透明度"

////// IDD_DGN_UNITCON_ELEC_DLG
IDC_UNITCON_FRM_ELEC_TYPE                     = "單位類型"
IDC_UNITCON_BTN_ELEC_CAPACITY                 = "電容"
IDC_UNITCON_BTN_ELEC_CHARGE                   = "電荷"
IDC_UNITCON_BTN_ELEC_CURRENT                  = "電流"
IDC_UNITCON_BTN_ELEC_POTENTIAL                = "電勢/電動勢"
IDC_UNITCON_BTN_ELEC_INDUCT                   = "電感"
IDC_UNITCON_BTN_ELEC_MAGFIELD                 = "磁場"
IDC_UNITCON_BTN_ELEC_MAGFLUX                  = "磁通量"
IDC_UNITCON_BTN_ELEC_RESIST                   = "電阻"

////// IDD_DGN_UNITCON_MISC_DLG
IDC_UNITCON_FRM_MISC_TYPE                     = "單位類型"
IDC_UNITCON_BTN_MISC_VOLFLOW                  = "體積流量"
IDC_UNITCON_BTN_MISC_SPECIFIC                 = "比容"
IDC_UNITCON_BTN_MISC_MASSFLOW                 = "質量流量"
IDC_UNITCON_BTN_MISC_INERTIA                  = "質量慣性矩"
IDC_UNITCON_BTN_MISC_TEMP                     = "溫度"

////// IDD_DGN_UNITCON_THER_DLG
IDC_UNITCON_FRM_THER_TYPE                     = "單位類型"
IDC_UNITCON_BTN_THER_HEATCAPA                 = "熱容量"
IDC_UNITCON_BTN_THER_HEATFLUX                 = "熱通量"
IDC_UNITCON_BTN_THER_HEATTRAN                 = "導熱係數"
IDC_UNITCON_BTN_THER_RADIAT                   = "輻射常數"
IDC_UNITCON_BTN_THER_SPECIFIC                 = "比熱"
IDC_UNITCON_BTN_THER_THERMAL                  = "熱傳導係數"

////// IDD_DGN_LOAD_WIND_KR09_DLG
IDD_DGN_LOAD_WIND_KR09_DLG                    = "風載重 ( KBC2009 )"
IDC_DGN_WIND_FRM_MEMB                         = "選擇構件"
IDC_DGN_WIND_BTN_ALL                          = "全選"
IDC_DGN_WIND_BTN_NON                          = "全不選"
IDC_DGN_WIND_FRM_WIND                         = "風載重"
IDC_DGN_WIND_LBL_WIND                         = "基本設計風速"
IDC_DGN_WIND_LBL_DIRF                         = "Direction Factor"
IDC_DGN_WIND_LBL_TOPO                         = "地況因數"
IDC_DGN_WIND_LBL_IMPO                         = "用途係數"
IDC_DGN_WIND_LBL_SURF                         = "表面粗糙度"
IDC_DGN_WIND_LBL_BUIL                         = "建物類型"
IDC_DGN_WIND_LBL_ROOF                         = "屋頂類型"
IDC_DGN_WIND_LBL_CHCK                         = "檢核點"
IDC_DGN_WIND_LBL_MEAN                         = "平均屋頂高度"
IDC_DGN_WIND_LBL_HAGL                         = "離地表高度"
IDC_DGN_WIND_LBL_ANGL                         = "屋頂水平夾角"
IDC_DGN_WIND_BTN_APPLY                        = "套用"
IDC_DGN_WIND_BTN_CANCE                        = "取消"

////// IDD_DGN_LOAD_WIND_KR16_CHK_DLG
IDD_DGN_LOAD_WIND_KR16_CHK_DLG                = "檢核條件 (簡易法)"
IDD_DGN_LOAD_WIND_KR22_CHK_DLG                = "檢核條件 (簡易法)"
IDC_DGN_WIND_FRM_BLD                          = "建物資料"
IDC_DGN_WIND_LBL_H                            = "平均屋頂高度"
IDC_DGN_WIND_LBL_B                            = "建物寬度"
IDC_DGN_WIND_LBL_D                            = "建物深度"
IDC_DGN_WIND_LBL_A                            = "樓版面積"
IDC_DGN_WIND_LBL_R                            = "Roof Angle"
IDC_DGN_WIND_FRM_RES                          = "檢核結果"
IDC_DGN_WIND_CHK_REGU                         = "規則"
IDC_DGN_WIND_CHK_IRRE                         = "不規則"
IDC_DGN_WIND_LBL_RES0                         = "檢核結果"
IDC_DGN_WIND_BTN_CLOSE                        = "關閉"

////// IDD_DGN_LOAD_WIND_KR16_DLG
IDD_DGN_LOAD_WIND_KR16_DLG                    = "風載重 ( KBC2016 )"
IDC_DGN_WIND_BTN_CHECK                        = "檢核條件 ..."
IDC_DGN_WIND_CHK_SIMP                         = "套用簡易法"
IDC_DGN_WIND_CHK_HIGH                         = "高層建築物"
IDC_DGN_WIND_LBL_BLDB                         = "建物寬度"
IDC_DGN_WIND_LBL_BLDD                         = "建物深度"
IDC_DGN_WIND_LBL_ENVI                         = "環境係數"

////// IDD_DGN_LOAD_WIND_US_DLG
IDD_DGN_LOAD_WIND_US_DLG                      = "風載重"
IDC_DGN_WIND_LBL_DIRE                         = "方向性因數"

////// IDD_FIGURE_LAYER_LNTP_DLG
IDD_FIGURE_LAYER_LNTP_DLG                     = "Line Type"
IDC_FIGURE_LAYER_LNTP_ORG_STC                 = "原始"
IDC_FIGURE_LAYER_LNTP_NEW_STC                 = "新增"
IDC_FIGURE_LAYER_LNTP_OK_BTN                  = "確認"
IDC_FIGURE_LAYER_LNTP_CANCEL_BTN              = "取消"

// DgnFactorCbDlg
IDD_DGN_FACTOR_CB_DLG                         = "側向扭轉挫屈修正係數 ( Cb )"
IDC_DGN_FACTOR_CB_CHK_CANTI                   = "懸臂"
IDC_DGN_FACTOR_CB_BTN_APPLY                   = "&套用"
IDC_DGN_FACTOR_CB_BTN_CANCEL                  = "&取消"
IDC_MOMENT_DIAGRAM_STC                        = "彎矩圖"
IDC_END_I_POSITION_STC                        = "端部(I)"
IDC_END_J_POSITION_STC                        = "端部(J)"
IDC_ONE_OF_FOUR_POSITION_STC                  = "1/4"
IDC_MID_POSITION_STC                          = "中央"
IDC_THREE_OF_FOUR_POSITION_STC                = "3/4"
IDC_CB_FACTOR_STC                             = "Cb : "

// DgnForceDlg
IDD_DGN_FORCE_DLG                            = "載重組合"
IDC_DGN_FORCE_BTN_ALL                         = "&全選"
IDC_DGN_FORCE_BTN_NON                         = "&全不選"
IDC_DGN_FORCE_BTN_INV                         = "&反選"
IDC_DGN_FORCE_BTN_ADD                         = "&新增"
IDC_DGN_FORCE_BTN_INS                         = "&插入"
IDC_DGN_FORCE_BTN_DEL                         = "&刪除"
IDC_DGN_FORCE_BTN_OK                          = "&確認"
IDC_DGN_FORCE_BTN_CANCEL                      = "&取消"

// DgnImportDlg
IDD_DGN_IMPORT_DLG                            = "匯入構件"
IDC_IMPORT_BTN_SELECT_ALL                     = "全選"
IDC_IMPORT_BTN_UNSELECT_ALL                   = "全不選"
IDC_IMPORT_BTN_IMPORT                         = "匯入"
IDC_IMPORT_BTN_CLOSE                          = "關閉"
IDC_FILE_NAME_STC                             = "檔案名稱"
IDC_IMPORT_FRAME                              = "選擇構件"
IDD_DGN_IMPORT_DLG_OPEN_FILE                  = "開啟舊檔"

// DgnImportPrefDlg
IDD_DGN_IMPORT_PREF_DLG                       = "匯入偏好設定"
IDC_DGN_IMPORT_PREF_OPEN_FILE                 = "開啟舊檔"
IDC_IMPORT_CHK_GENERAL                        = "一般事項"
IDC_IMPORT_FRAME_DRAWING                      = "Drawing"
IDC_IMPORT_CHK_DRAWING_LAYER                  = "圖層性質"
IDC_IMPORT_CHK_DRAWING_FILE                   = "圖框/圖例"
IDC_IMPORT_CHK_DRAWING_DWG                    = "圖檔選項"
IDC_IMPORT_FRAME_WORD                         = "Word"
IDC_IMPORT_CHK_WORD_STYLE                     = "字型與格式"
IDC_IMPORT_FRAME_PREVIEW                      = "DWG Preview"
IDC_IMPORT_CHK_PREVIEW_RBB                    = "Batch Beam"
IDC_IMPORT_CHK_PREVIEW_RBC                    = "Batch Column"
IDC_IMPORT_FRAME_DESIGN                       = "設計"
IDC_IMPORT_CHK_DESIGN_SECTION                 = "斷面增量"
IDC_IMPORT_CHK_DESIGN_SIZE_RCS                = "RC斷面限制"
IDC_IMPORT_CHK_DESIGN_SIZE_STL                = "鋼構斷面限制"
IDC_IMPORT_CHK_DESIGN_SIZE_SRC                = "SRC斷面限制"
IDC_IMPORT_CHK_DESIGN_SMART_BB                = "Smart Design Option ( Batch Beam )"
IDC_IMPORT_CHK_DESIGN_SMART_BC                = "Smart Design Option ( Batch Column )"
IDC_IMPORT_FRAME_REBAR                        = "鋼筋選項"
IDC_IMPORT_CHK_DESIGN_BAR_OPT                 = "構件設計鋼筋選項"
IDC_IMPORT_CHK_DESIGN_BAR_SPA                 = "鋼筋間距選項"
IDC_IMPORT_FRAME_SECTION                      = "Section List"
IDC_IMPORT_CHK_SECTION_STL                    = "Steel Section List"
IDC_IMPORT_CHK_SECTION_ALU                    = "Aluminum Section List"
IDC_IMPORT_BTN_ALL                            = "全選"
IDC_IMPORT_BTN_NONE                           = "全不選"
IDC_IMPORT_BTN_OK                             = "確認"
IDC_IMPORT_BTN_APPLY                          = "套用"
IDC_IMPORT_BTN_CANCEL                         = "取消"

// DgnKFactorDlg
IDC_DGN_KFACTOR_BTN_APPLY                     = "&套用"
IDC_DGN_KFACTOR_BTN_CANCEL                    = "&取消"
IDC_DGN_KFACTOR_FRAME                         = "K係數"

// DgnQuantityFormDlg
IDC_QUAN_CREA_BTN                             = "產生"
IDC_QUAN_SAVE_BTN                             = "匯出至Excel ..."
IDC_QUAN_SIZE_BTN                             = "調整欄寬"
IDC_QUAN_NOTICE                               = "※ 表格內為每單位長度之數量"

// DgnRebarDlg
IDD_DGN_REBAR_DLG                             = "鋼筋選項"
IDC_OPTION_REBAR_CHECK_USE_USERLIST           = "使用自定義鋼筋"
IDC_OPTION_SPACE_BTN_ADD                      = "新增"
IDC_OPTION_SPACE_BTN_REMOVE                   = "移除"
IDC_OPTION_SPACE_CHECK_USE_USERLIST           = "使用自定義間距"
IDC_OPTION_BTN_APPLY                          = "套用"
IDC_OPTION_BTN_CLOSE                          = "關閉"
IDC_REBAR_CODE_STC                            = "鋼筋規範"
IDC_REBAR_OPT_DGN_GROUP_STC                   = "構件設計鋼筋選項"
IDC_REBAR_SPACING_LIST_GOURP_STC              = "常用間距"

// DgnRebarRCPageDlg
IDC_OPTION_REBAR_RC_SLAB_STC                  = "樓版"
IDC_OPTION_REBAR_RC_BEAM_COLUMN_STC           = "梁"
IDC_OPTION_REBAR_RC_COLUMN_STC                = "柱"
IDC_OPTION_REBAR_RC_SHEAR_WALL_STC            = "剪力牆"
IDC_OPTION_REBAR_RC_BASEMENT_WALL_STC         = "地下室外牆"
IDC_OPTION_REBAR_RC_FOOTING_STC               = "基礎"
IDC_OPTION_REBAR_RC_LABEL_UCBF1               = "聯合基礎"
IDC_OPTION_REBAR_RC_STRIP_FOOTING_STC         = "連續基礎"
IDC_OPTION_REBAR_RC_BUTTRESS_STC              = "扶壁"
IDC_OPTION_REBAR_RC_STAIR_STC                 = "樓梯"
IDC_OPTION_REBAR_RC_CORBEL_BRAKET_STC         = "托梁/托架"
IDC_OPTION_REBAR_RC_BEAM_TABLE_STC            = "梁表格"
IDC_OPTION_REBAR_RC_SLAB_TABLE_STC            = "樓版表格"

// DgnRebarSRCPageDlg
IDC_REBAR_SRC_COLUMN_STC                      = "SRC柱"

// DgnSelectDlg
IDC_BTN_SELECT                                = "選擇"
IDC_BTN_CLOSE                                 = "關閉"

// DgnSetDefaultDlg
IDD_DGN_DEFAULT_DLG                           = "設為預設值"
IDC_DEFAULT_FRAME_RC                          = "RC造"
IDC_DEFAULT_FRAME_STL                         = "鋼構造"
IDC_DEFAULT_FRAME_SRC                         = "SRC造"
IDC_DEFAULT_FRAME_ALU                         = "鋁構造"
IDC_DEFAULT_FRAME_RFM                         = "構件補強"
IDC_DEFAULT_BTN_SET_DEFAULT                   = "設為預設值"
IDC_DEFAULT_BTN_CLOSE                         = "關閉"
IDC_DEFAULT_LABEL_GSLAB                       = "樓版"
IDC_DEFAULT_LABEL_GURBE                       = "梁"
IDC_DEFAULT_LABEL_GURCO                       = "柱"
IDC_DEFAULT_LABEL_GURGC                       = "柱 (任意斷面)"
IDC_DEFAULT_LABEL_GURSW                       = "剪力牆"
IDC_DEFAULT_LABEL_GURDW                       = "剪力牆 (組合牆)"
IDC_DEFAULT_LABEL_GUFDN                       = "基礎"
IDC_DEFAULT_LABEL_GURCF                       = "基礎 (聯合)"
IDC_DEFAULT_LABEL_GURSF                       = "基礎 (連續)"
IDC_DEFAULT_LABEL_GURBW                       = "地下室外牆"
IDC_DEFAULT_LABEL_GURST                       = "樓梯"
IDC_DEFAULT_LABEL_GURCB                       = "托梁/托架"
IDC_DEFAULT_LABEL_GURBL                       = "梁表格"
IDC_DEFAULT_LABEL_GURSL                       = "樓版表格"
IDC_DEFAULT_LABEL_GURBU                       = "扶壁"
IDC_DEFAULT_LABEL_GUSSG                       = "梁&&柱"
IDC_DEFAULT_LABEL_GUSBP                       = "基座板"
IDC_DEFAULT_LABEL_GUSBC                       = "螺栓接合"
IDC_DEFAULT_LABEL_GUSCG                       = "天車梁"
IDC_DEFAULT_LABEL_GUSPG                       = "桁條&&圍梁"
IDC_DEFAULT_LABEL_GUSWO                       = "腹板開孔"
IDC_DEFAULT_LABEL_GUSST                       = "鋼製樓梯"
IDC_DEFAULT_LABEL_GUSWE                       = "銲接"
IDC_DEFAULT_LABEL_GUSEP                       = "預埋板"
IDC_DEFAULT_LABEL_GUCCB                       = "合成梁"
IDC_DEFAULT_LABEL_GUCCO                       = "柱"
IDC_DEFAULT_LABEL_GUCFT                       = "CFT柱"
IDC_DEFAULT_LABEL_GUCBP                       = "基座板"
IDC_DEFAULT_LABEL_GUAMT                       = "梁&&柱 (任意斷面)"
IDC_DEFAULT_LABEL_GUAAG                       = "梁&&柱"
IDC_DEFAULT_LABEL_NOTICE                      = "※ 選擇之構件參數將指派為預設值"
IDC_DEFAULT_LABEL_GURRW                       = "擋土牆"

//// IDD_DGN_PREF_GENERAL_DLG
IDC_DGN_PREF_GEN_FRAME_MODE                   = "介面模式"
IDC_DGN_PREF_GEN_RADIO_MODE_SIMPLE            = "簡易模式 (計算模式)"
IDC_DGN_PREF_GEN_RADIO_MODE_PROJECT           = "專案模式 (計算/出圖/報表/數量表/Gen,ADS Link模式)"
IDC_DGN_PREF_GEN_RADIO_MODE_CHECK             = "檢核模式 (檢核設計結果)"
IDC_DGN_PREF_GEN_FRAME_REPORT                 = "簡易模式的報表型式"
IDC_DGN_PREF_GEN_RADIO_REPORT_DET             = "詳細計算"
IDC_DGN_PREF_GEN_RADIO_REPORT_SUM             = "設計摘要"
IDC_DGN_PREF_GEN_RADIO_REPORT_INP             = "計算參數"
IDC_DGN_PREF_GEN_FRAME_CHECK                  = "檢核模式的報表型式"
IDC_DGN_PREF_GEN_CHECK_DEFAULT_TYPE           = "預設報表型式"
IDC_DGN_PREF_GEN_RADIO_CHK_REPORT_DET         = "詳細計算"
IDC_DGN_PREF_GEN_RADIO_CHK_REPORT_SUM         = "設計摘要"
IDC_DGN_PREF_GEN_CHECK_CONTENTS               = "報表內容"
IDC_DGN_PREF_GEN_RADIO_CHK_CONTENT_SIMPLE     = "簡易模式"
IDC_DGN_PREF_GEN_RADIO_CHK_CONTENT_PROJECT    = "專案模式"
IDC_DGN_PREF_GEN_FRAME_COVER                  = "保護層厚度"
IDC_DGN_PREF_GEN_RADIO_CLEAR_COVER            = "使用淨厚度"
IDC_DGN_PREF_GEN_RADIO_DISTANCE               = "使用混凝土表面至鋼筋中心"
IDC_DGN_PREF_GEN_NOTICE                       = "※ 柱(RC, SRC)皆使用混凝土表面至鋼筋中心"
IDC_DGN_PREF_GEN_FRAME_RESULT                 = "設計結果數據"
IDC_DGN_PREF_GEN_CHECK_KEEP_RESULT            = "修改設計參數時保留前次設計結果"
IDC_DGN_PREF_GEN_CHECK_INCLUDE_RESULT         = "於輸入檔(Excel)中保留設計結果"
IDC_DGN_PREF_GEN_CHECK_SHOW_APPLY             = "於設定視窗中顯示[套用]功能鍵"
IDC_DGN_PREF_BTN_DEFAULT_GEN                  = "回復預設值"

////// IDD_DGN_PREF_SYSTEM_DLG
IDC_DGN_PREF_SYSTEM_CHK_AUTO_SAVE             = "自動儲存"
IDC_DGN_PREF_SYSTEM_STC1                      = "於每"
IDC_DGN_PREF_SYSTEM_STC2                      = "分鐘"
IDC_DGN_PREF_SYSTEM_CHK_MAKE_BACKUP           = "建立備份檔 (.bak)"
IDC_DGN_PREF_SYSTEM_ACTION_FRAME              = "工作樹的選取方式"
IDC_DGN_PREF_SYSTEM_CHK_MOUSE_SINGLE          = "滑鼠單擊或使用鍵盤上下鍵"
IDC_DGN_PREF_SYSTEM_CHK_REPORT_VIEW           = "Change Report View with Checking Result of Selected Member"
IDC_DGN_PREF_SYSTEM_USER_IFORM_FRAME          = "使用者資訊"
IDC_DGN_PREF_SYSTEM_COMPANY_FULL              = "公司名稱 (全名) :"
IDC_DGN_PREF_SYSTEM_COMPANY_SHORT             = "公司名稱 (簡稱) :"
IDC_DGN_PREF_SYSTEM_ADDRESS                   = "地址 :"
IDC_DGN_PREF_SYSTEM_WEBSITE                   = "網站 (URL) :"
IDC_DGN_PREF_SYSTEM_TELL                      = "電話 :"
IDC_DGN_PREF_SYSTEM_FAX                       = "傳真 :"
IDC_DGN_PREF_SYSTEM_CHK_APPLY_USER_INFO       = "於報表中套用上列資訊"
IDC_DGN_PREF_BTN_DEFAULT_SYSTEM               = "回復預設值"

////// IDD_DGN_PREF_WORD_DLG
IDC_DGN_PREF_BTN_DEFAULT_WORD                 = "回復預設值"
IDC_DGN_PREF_FRAME_STYLE                      = "格式"

////// IDD_DGN_INIT_DLG
IDD_DGN_INIT_DLG                              = "初始值設定"
IDC_DGN_INIT_TAB_COMM                         = "一般"
IDC_DGN_INIT_TAB_RPRT                         = "Report"
IDC_DGN_INIT_TAB_DATA                         = "資料庫"
IDC_DGN_INIT_TAB_CODE                         = "設計規範"
IDC_DGN_INIT_TAB_BDGN                         = "Batch Design"
IDC_DGN_INIT_BTN_DEFAULT_ALL                  = "回復預設值 (全部)"
IDC_DGN_INIT_BTN_IMPORT                       = "匯入..."
IDC_DGN_INIT_BTN_EXPORT                       = "匯出..."
IDC_DGN_INIT_BTN_APPLY                        = "套用"
IDC_DGN_INIT_BTN_CLOSE                        = "取消"

/////// IDD_DGN_INIT_COMM_DLG
IDC_DGN_INIT_COMM_FRM_UNIT                    = "單位"
IDC_DGN_INIT_COMM_RDO_UNIT_USER               = "自定義"
IDC_DGN_INIT_COMM_RDO_UNIT_PRED               = "單位系統"
IDC_DGN_INIT_COMM_FRM_MODE                    = "程式模式"
IDC_DGN_INIT_COMM_RDO_MODE_SIMP               = "簡易模式"
IDC_DGN_INIT_COMM_RDO_MODE_PROJ               = "專案模式"
IDC_DGN_INIT_COMM_RDO_MODE_CHCK               = "檢核模式"
IDC_DGN_INIT_DESC_MODE_SIMP                   = "僅計算模式"
IDC_DGN_INIT_DESC_MODE_PROJ                   = "計算/出圖/報表/數量表/Gen,ADS Link模式"
IDC_DGN_INIT_DESC_MODE_CHCK                   = "檢核設計結果"
IDC_DGN_INIT_COMM_BTN_DEFAULT                 = "回復預設值"

/////// IDD_DGN_INIT_DATA_DLG
IDC_DGN_INIT_DATA_FRM_STL                     = "鋼構材資料庫"
IDC_DGN_INIT_DATA_LBL_STL_MATL                = "材料"
IDC_DGN_INIT_DATA_LBL_STL_SECT                = "斷面"
IDC_DGN_INIT_DATA_CHK_STL_SECT                = "使用自定義斷面"
IDC_DGN_INIT_DATA_FRM_ALU                     = "鋁構材資料庫"
IDC_DGN_INIT_DATA_LBL_ALU_MATL                = "材料"
IDC_DGN_INIT_DATA_LBL_ALU_SECT                = "斷面"
IDC_DGN_INIT_DATA_CHK_ALU_SECT                = "使用自定義斷面"
IDC_DGN_INIT_DATA_FRM_RFM                     = "補強材料資料庫"
IDC_DGN_INIT_DATA_LBL_RFM_MATF                = "材料 (FRP)"
IDC_DGN_INIT_DATA_LBL_RFM_MATS                = "材料 (Steel)"
IDC_DGN_INIT_DATA_FRM_BAR                     = "鋼筋資料庫"
IDC_DGN_INIT_DATA_LBL_BAR_RBAR                = "鋼筋"
IDC_DGN_INIT_DATA_CHK_BAR_SPAC                = "使用自定義間距"
IDC_DGN_INIT_DATA_BTN_DEFAULT                 = "回復預設值"

/////// IDD_DGN_INIT_CODE_DLG
IDC_DGN_INIT_CODE_FRM_CODE                    = "設計規範"
IDC_DGN_INIT_CODE_LBL_CODE_RCS                = "RC造"
IDC_DGN_INIT_CODE_LBL_CODE_STL                = "鋼構造"
IDC_DGN_INIT_CODE_LBL_CODE_SRC                = "SRC造"
IDC_DGN_INIT_CODE_LBL_CODE_ALU                = "鋁構造"
IDC_DGN_INIT_CODE_LBL_CODE_CFS                = "冷軋型鋼"
IDC_DGN_INIT_CODE_LBL_CODE_RFM                = "構件補強"
IDC_DGN_INIT_CODE_FRM_LOAD                    = "設計載重"
IDC_DGN_INIT_CODE_LBL_LOAD_LIVE               = "標準活載重"
IDC_DGN_INIT_CODE_LBL_LOAD_WIND               = "風載重"
IDC_DGN_INIT_CODE_LBL_LOAD_SNOW               = "雪載重"
IDC_DGN_INIT_CODE_BTN_DEFAULT                 = "回復預設值"

/////// IDD_DGN_INIT_BDGN_DLG
FONT_SIZE_MEMBER_NAME                         = "Font size of Member Name"
SYMBOL_SIZE_END_RELEASE                       = "Symbol size of End Release"
FONT_SIZE_REBAR_INFO                          = "Font size of Rebar Information"
FONT_SIZE_DESIGN_RESULT                       = "Font size of Design Result"
FONT_SIZE_COLM_LOCATION_DWG                   = "Font size of Column Location Drawing"
LINE_WEIGHT_SELECTED_ITEM                     = "Line weight of Selected Item"

//IDD_DGN_RBAR_MATL_CHK_DLG
IDC_DGN_RBAR_MATL_CHK_DLG_STC1                = "依鋼筋號數所指派的材料強度設定與Design+的設定不同"
IDC_DGN_RBAR_MATL_CHK_DLG_STC2                = "要變更Design+的設定嗎?"
IDC_DGN_RBAR_MATL_CHK_DLG_STC3                = "( RC > Batch Wall > Smart Design Option > Material by Rebar Dia )"
IDC_DGN_RBAR_MATL_CHK_DLG_STC4                = "Yes"
IDC_DGN_RBAR_MATL_CHK_DLG_STC6                = ": 將套用已連結程式的設定"
IDC_DGN_RBAR_MATL_CHK_DLG_STC7                = ": 將維持原設定"
IDC_DGN_RBAR_MATL_CHK_DLG_STC5                = "No"

//IDD_DGN_ALU_DEFL_DLG
IDC_DGN_DEFL_EDT_SPAN                         = "依跨度"
IDC_DGN_DEFL_EDT_VALUE                        = "依數值"
IDC_DGN_DEFL_EDT_SPAN2                        = "依跨度"
IDC_DGN_DEFL_EDT_ADDITIONAL                   = "外加"
IDC_DGN_DEFL_EDT_SELF_GLASS                   = "自重 ( Glass )"
IDC_DGN_DEFL_EDT_SPAN3                        = "依跨度"
IDC_DGN_DEFL_EDT_VALUE3                       = "依數值"
IDC_DGN_DEFL_BTN_APPL                         = "&套用"
IDC_DGN_DEFL_BTN_CNCL                         = "&取消"
IDC_DGN_DEFL_FRM_L_SMALL                      = "L ≤ 4.110m"
IDC_DGN_DEFL_FRM_L_LARGE                      = "L > 4.110m"

//IDD_DGN_ALU_OPTION_DLG
IDD_DGN_ALU_OPTION_DLG                        = "鋁構造選項"

//IDD_DGN_ALU_OPTION_GEN_DLG
IDC_DGN_ALU_OPT_SECTION_STC                   = "斷面資料庫檔 (*.sec)"
IDC_DGN_ALU_OPT_CHK_UNIT                      = "使用SI單位系統匯出"

//IDD_DGN_ANCH_BOLT_DLG
IDS_DGN_ANCH_BOLT_TOOLTIP_ABRG_STUD           = "Diameter for Net Bearing Area ( Abrg ) of Headed Stud"
IDS_DGN_ANCH_BOLT_TOOLTIP_ABRG_ANCH           = "Diameter for Net Bearing Area ( Abrg ) of Anchor Bolt"
IDS_DGN_ANCH_BOLT_TOOLTIP_ABRG_RBAR           = "Diameter for Net Bearing Area ( Abrg ) of Headed deformed bar"

//IDD_DGN_ANCHOR_DLG
IDD_DGN_ANCHOR_DLG                            = "錨栓資料"
IDC_DGN_ANCHOR_FRM_MEMB                       = "選擇構件"
IDC_DGN_ANCHOR_BTN_ALL                        = "全選"
IDC_DGN_ANCHOR_BTN_NON                        = "全不選"
IDC_DGN_ANCHOR_FRM_CONC                       = "混凝土"
IDC_DGN_ANCHOR_RDO_CRACK                      = "已開裂"
IDC_DGN_ANCHOR_RDO_UNCRA                      = "未開裂"
IDC_DGN_ANCHOR_LBL_CONC_KCKC                  = "混凝土拉破強度係數 (kc)"
IDC_DGN_ANCHOR_FRM_ANCH                       = "錨栓"
IDC_DGN_ANCHOR_LBL_ANCH_NPNP                  = "拔出強度 (Np)"
IDC_DGN_ANCHOR_LBL_ANCH_EHEH                  = "Dist. of J/L-Bolt (eh)"
IDC_DGN_ANCHOR_FRM_FACT                       = "強度折減因數"
IDC_DGN_ANCHOR_LBL_FACT_STLT                  = "錨栓/拉力"
IDC_DGN_ANCHOR_LBL_FACT_STLV                  = "錨栓/剪力"
IDC_DGN_ANCHOR_LBL_FACT_CONT                  = "混凝土/拉力"
IDC_DGN_ANCHOR_LBL_FACT_CONV                  = "混凝土/剪力"
IDC_DGN_ANCHOR_BTN_APPLY                      = "&套用"
IDC_DGN_ANCHOR_BTN_CANCE                      = "&取消"
IDC_DGN_ANCHOR_BTN_DEFAULT                    = "&回復預設值"

//IDD_DGN_LOAD_SNOW_DLG
IDD_DGN_LOAD_SNOW_DLG                         = "雪載重"
IDC_DGN_SNOW_FRM_SNOW                         = "雪載重"
IDC_DGN_SNOW_LBL_SNOW                         = "基本地表雪載重"
IDC_DGN_CHK_HILLSIDE                          = "山坡或山區"
IDC_DGN_SNOW_LBL_BASE                         = "基本屋頂雪載重因數"
IDC_DGN_SNOW_LBL_EXPO                         = "暴露類別"
IDC_DGN_SNOW_LBL_TEMP                         = "溫度因數"
IDC_DGN_SNOW_LBL_IMPO                         = "用途類別"
IDC_DGN_SNOW_LBL_ROOF                         = "屋頂類別"
IDC_DGN_SNOW_LBL_ANGL                         = "屋頂夾角"
IDC_DGN_CHK_CONSIDER_RAIN_LOAD                = "考慮額外雨水載重"
IDC_DGN_SNOW_BTN_APPLY                        = "&套用"
IDC_DGN_SNOW_BTN_CANCE                        = "&取消"
IDC_DGN_SNOW_FRM_MEMB                         = "選擇構件"
IDC_DGN_SNOW_BTN_ALL                          = "全選"
IDC_DGN_SNOW_BTN_NON                          = "全不選"

//IDD_DGN_LOAD_SNOW_US_DLG
IDC_DGN_SNOW_LBL_ANGL_ROOF                    = "屋頂夾角"
IDC_DGN_SNOW_LBL_ANGL_EAVE                    = "屋簷夾角"
IDC_DGN_SNOW_LBL_HORI_DIST                    = "水平距離"


//IDD_DGN_STL_OPTION_SECT_DLG
IDC_DGN_STL_OPT_DGN_STATIC_BP                 = "基座板 (板類型)"
IDC_DGN_STL_OPT_DGN_CHK_SOFT_BP               = "柔性板 (FEM分析)"
IDC_DGN_STL_OPT_DGN_CHK_RIGD_BP               = "剛性板"
IDC_DGN_STL_OPT_DGN_NOTICE_BP                 = "※ 柔性板僅提供進行FEM分析 (無設計)"
IDC_DGN_STL_OPT_DGN_STATIC_EP                 = "預埋板 (板類型)"
IDC_DGN_STL_OPT_DGN_CHK_SOFT_EP               = "柔性板 (FEM分析)"     
IDC_DGN_STL_OPT_DGN_CHK_RIGD_EP               = "剛性板"             
IDC_DGN_STL_OPT_DGN_NOTICE_EP                 = "※ 柔性板僅提供進行FEM分析 (無設計)"

//IDD_DGN_STL_OPTION_DLG
IDD_DGN_STL_OPTION_DLG                        = "鋼構選項"
IDC_DGN_STL_OPT_BTN_DEF                       = "&回復預設值"
IDC_DGN_STL_OPT_BTN_OK                        = "&確認"
IDC_DGN_STL_OPT_BTN_APPLY                     = "&套用"
IDC_DGN_STL_OPT_BTN_CANCEL                    = "&取消"

//IDD_DGN_STL_OPTION_SECT_DLG
IDC_DGN_STL_OPT_SECT_STC_DB                   = "資料庫"
IDC_DGN_STL_OPT_SECT_STC_SHAPE                = "形狀"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_ADD_DB          = ">>"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_DEL_DB          = "<<"
IDC_DGN_STL_OPT_SECT_STC_BEAM                 = "梁"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_UP              = "上移"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_DN              = "下移"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_ADD_DB        = ">>"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_DEL_DB        = "<<"
IDC_DGN_STL_OPT_SECT_STC_COLUMN               = "柱"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_UP            = "上移"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_DN            = "下移"
IDC_DGN_STL_OPT_SECT_STC_USER                 = "自定義"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_ADD_USER        = ">> 梁"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_ADD_USER      = ">> 柱"
IDC_DGN_STL_OPT_SECT_CHK_AUTO_GEN_NAME        = "自動產生斷面名稱"
IDC_DGN_STL_OPT_SECT_CHK_USE_USER_LIST        = "使用自定義斷面清單"

//IDD_DGN_ALU_OPTION_SECT_DLG
IDC_DGN_ALU_OPT_SECT_STC_DB                   = "資料庫"
IDC_DGN_ALU_OPT_SECT_STC_SHAPE                = "形狀"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_ADD_DB          = ">>"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_DEL_DB          = "<<"
IDC_DGN_ALU_OPT_SECT_STC_BEAM                 = "梁"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_UP              = "上移"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_DN              = "下移"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_ADD_DB        = ">>"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_DEL_DB        = "<<"
IDC_DGN_ALU_OPT_SECT_STC_COLUMN               = "柱"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_UP            = "上移"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_DN            = "下移"
IDC_DGN_ALU_OPT_SECT_STC_USER                 = "自定義"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_ADD_USER        = ">> 梁"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_ADD_USER      = ">> 柱"
IDC_DGN_ALU_OPT_SECT_CHK_AUTO_GEN_NAME        = "自動產生斷面名稱"
IDC_DGN_ALU_OPT_SECT_CHK_USE_USER_LIST        = "使用自定義斷面清單"

//IDD_DGN_STIF_DLG
IDD_DGN_STIF_DLG                              = "加勁板/集中載重資料"
IDC_DGN_STIF_FRM_MEMB                         = "選擇構件"
IDC_DGN_STIF_BTN_ALL                          = "全選"
IDC_DGN_STIF_BTN_NON                          = "全不選"
IDC_DGN_STIF_FRM_SECT                         = "加勁板"
IDC_DGN_STIF_LBL_SECT_B                       = "寬度"
IDC_DGN_STIF_LBL_SECT_T                       = "厚度"
IDC_DGN_STIF_LBL_SECT_S                       = "間距"
IDC_DGN_STIF_CHK_FLG_BR                       = "具側撐受壓翼板"
IDC_DGN_STIF_FRM_FORC                         = "集中載重"
IDC_DGN_STIF_LBL_FORC_V                       = "集中力"
IDC_DGN_STIF_LBL_FORC_M                       = "彎矩"
IDC_DGN_STIF_LBL_FORC_B                       = "側支撐長度"
IDC_DGN_STIF_LBL_FORC_D                       = "至支承位置距離"
IDC_DGN_STIF_BTN_DEFAULT                      = "&回復預設值"
IDC_DGN_STIF_BTN_APPLY                        = "&套用"
IDC_DGN_STIF_BTN_CANCE                        = "&取消"

//IDD_DGN_STL_SECTION_DLG
IDC_DGN_CHK_DB                                = "型鋼資料庫"
IDC_DGN_LABEL_SHAPE                           = "形狀"

/////// IDD_DGN_RFM_MATL_DLG
IDC_DGN_RFM_MATL_CHK_USER                     = "自定義補強材料"
IDC_DGN_RFM_MATL_LBL_MATL                     = "補強材料"
IDC_DGN_RFM_MATL_STRENGTH_RATIO               = "強度比值"
IDC_DGN_RFM_MATL_STRAIN_RATIO                 = "應變比值"

/////// IDD_DGN_RFM_MATL_INFO_DLG
IDD_DGN_RFM_MATL_INFO_DLG                     = "玻纖/碳纖材料資訊"
IDS_DGN_RFM_MATL_INFO_NAME                    = "名稱"
IDS_DGN_RFM_MATL_INFO_THICK                   = "厚度"
IDS_DGN_RFM_MATL_INFO_YIELD                   = "降伏強度"
IDS_DGN_RFM_MATL_INFO_ELAST                   = "彈性模數"
IDS_DGN_RFM_MATL_INFO_STRAIN                  = "最大應變"
IDS_DGN_RFM_MATL_INFO_FIBER_TYPE              = "纖維\n類型"

////// IDD_DGN_MEMBER_LIST_BTN_DLG
IDC_DGN_LIST_DLG_TXT_REM                      = "Ctrl+Up/Down 可複製"

//IDD_DGN_STL_SECTION_EX_DLG
IDD_DGN_STL_SECTION_EX_DLG                    = "Steel Section Property"
IDC_DGN_FRM_SECTION                           = "斷面"
IDC_DGN_STATIC_PICTURE                        = "Drawing"
IDC_DGN_FRM_SECTIONPROPERTY                   = "斷面性質"

/////// IDC_DGN_CRANE_COMBO_TYPE
IDC_DGN_CRANE_BTN_APPLY                       = "&套用"
IDC_DGN_CRANE_BTN_CANCEL                      = "&取消"
IDC_DGN_CRANE_FRAME                           = "天車類型"
IDS_STL_CRANE_TYPE_MONORAIL_MOTOR             = "單軌起重機 (Motor Operated)"
IDS_STL_CRANE_TYPE_REMOTE_CONTROL_BRIGE       = "具駕駛室或遠端控制起重機 (Motor Operated)"
IDS_STL_CRANE_TYPE_PENDENT_BRIGE              = "吊墜式橋式起重機 (Motor Operated)"
IDS_STL_CRANE_TYPE_BRIGE_AND_MONORAIL         = "橋或單軌起重機 (Hand Brdige, trolley, hoist)"

/**/IDC_GUOPT_COMBO_LOAD_LIVE_TEXT            = "標準活載重"

/////// IDD_DGN_OPT_LOAD_DLG
/**/IDD_DGN_OPT_LOAD_DLG                      = "設計載重"
/**/IDD_DGN_OPT_LOAD_TEXT                     = "已變更標準活載重規範"
/**/IDD_DGN_OPT_LOAD_TEXT2                    = "已施加的活載重將會刪除"
/**/IDD_DGN_OPT_LOAD_TEXT3                    = "要繼續嗎?"
/**/IDD_DGN_OPT_LOAD_YES                      = "Yes"
/**/IDD_DGN_OPT_LOAD_NO                       = "No"

/////// IDD_DGN_ZOOM_DLG
IDD_DGN_ZOOM_SECT_DLG                         = "斷面預覽"
IDD_DGN_ZOOM_RSLT_DLG                         = "Result Preview"
IDD_DGN_ZOOM_PMCV_DLG                         = "PM Interaction Curve"
IDD_DGN_ZOOM_MMCV_DLG                         = "MM Interaction Curve"
IDC_DGN_ZOOM_CHK_MESH                         = "網格線"
IDC_DGN_ZOOM_CHK_CONT                         = "等值線"
IDC_DGN_ZOOM_CHK_VALU                         = "數值"
IDC_DGN_ZOOM_LBL_CLOS                         = "雙擊可關閉"

/////// IDD_DGN_PBD_PROG_DLG
IDD_DGN_PBD_PROG_DLG_PBRBE                    = "執行基本設計 [檢核RC梁 ...]"
IDD_DGN_PBD_PROG_DLG_PBRCO                    = "執行基本設計 [檢核RC柱 ...]"
IDD_DGN_PBD_PROG_DLG_PBRSW                    = "執行基本設計 [檢核RC剪力牆 ...]"
IDD_DGN_PBD_PROG_DLG_MEMB                     = "構件名稱"
IDD_DGN_PBD_PROG_DLG_LCOM                     = "載重組合"

/////// IDD_DGN_REPORT_OPT_DATA_DLG
IDC_DGN_CHK_VISITEM                           = "包含視覺化圖表內容"
IDC_DGN_CHK_PRNITEM                           = "列印時包含視覺化圖表內容"
IDC_DGN_CHK_RESTABLE                          = "顯示結果表格"
IDC_DGN_CHK_BARCLUSTR                         = "顯示條狀圖"
IDC_DGN_CHK_SIMHEAD                           = "簡化的列標題"

/////// IDD_DGN_REPORT_OPT_PAGE_DLG
IDC_DGN_FRM_CALC_RSLT                         = "Calcuation Result Summary"
IDC_DGN_FRM_DETL_RPRT                         = "Detail Report"
IDC_DGN_FRM_SUMM_RPRT                         = "Summary Report"
IDC_DGN_FRM_RPRT_UNIT                         = "Unit System"
IDC_DGN_CHK_CODE_UNIT                         = "Report in Design Code Unit"
IDC_DGN_CHK_UNIT_USER                         = "User Unit System"

/////// IDD_DGN_REPORT_OPT_NUMB_DLG
IDS_DGN_REPORT_OPT_TAB_NUMB_FORM              = "Number Format"
IDS_DGN_BTN_SET_BY_UNIT_TYPE                  = "Set By Unit Type"
IDS_DGN_BTN_RESET_UNIT_TYPE                   = "Reset Unit Type"
IDC_DGN_BTN_EDIT_IN_TABLE_FORM                = "Edit in Table Form"

/////// IDD_DGN_REPORT_OPT_DLG
IDD_DGN_REPORT_OPT_DLG                        = "報表選項"
IDS_DGN_REPORT_OPT_TAB_GLBL_DATA              = "通用設定"
IDS_DGN_REPORT_OPT_TAB_MEMB_DATA              = "構件設定"
IDC_DGN_REPORT_OPT_BY_MEMBER                  = "依構件類型設定報表選項"

/////// IDD_DGN_USER_STRN_FACT_DLG
IDS_DGN_GET_DEFAULT_STRN_FACT                 = "Get Default Strength Factor"
IDS_DGN_GET_DEFAULT_STRN_REDUCT_FACT          = "Get Default Strength Reduction Factor"
IDS_DGN_APPLY_USER_STRN_FACT                  = "Apply User Strength Factor"
IDS_DGN_APPLY_USER_STRN_REDUCT_FACT           = "Apply User Strength Reduction Factor"

/////// IDD_DGN_LAYR_DLG
IDS_DGN_CHANGE_COLOR_IN_DWG_PREVIEW_DLG       = "Change color by Drawing Preview Dialog"
IDS_DGN_LAYER_EXIST_EMPTY_NAME                = "Layer(s) without name is exist."
IDS_DGN_LAYER_EXIST_DUPLICATED                = "Duplicated layer name is exist."

/////// IDD_DGN_GROUP_DLG
IDS_DGN_GROUP_MANAGER                         = "Group Manager"
IDS_DGN_EDIT_GROUP                            = "Edit Group"
IDS_DGN_GROUP_IMPORT_FILE                     = "Import File ..."
IDS_DGN_GROUP_IMPORT_CLIPBOARD                = "Import Clipboard"
IDS_DGN_GROUP_IMPORT_FAIL                     = "Import of following group is Failed."
IDS_DGN_GROUP_IMPORT_GROUPING_FILE            = "Import Grouping File"
IDS_DGN_GROUP_IMPORT_NOT_UNICODE_FILE         = "Selected file is not Unicode.\nSave in Unicode and retry."
IDS_DGN_GROUP_NAME_OLD_EMPTY                  = "Existing group name is not selected.\nSelect group name by List control."
IDS_DGN_GROUP_NAME_NEW_EMPTY                  = "New group name is not entered."

/////// IDD_DGN_GROUP_CTRL_DLG
IDS_DGN_FROM_STORY_NAME_IS_EMPTY              = "FROM Story Name is empty."
IDS_DGN_TO_STORY_NAME_IS_EMPTY                = "TO Story Name is empty."
IDS_DGN_STORY_NAME_IS_SAME					  = "FROM Story Name and TO Story Name is same."
IDS_DGN_STORY_INC_IS_ZERO					  = "Story Increment is zero."
IDS_DGN_FROM_STORY_HIGHER_TO_STORY            = "FROM Story is higher than TO Story."

/////// IDD_DGN_NUMB_FORM_DLG
IDD_DGN_NUMB_FORM_DLG                         = "Number Format"
IDC_SET_CURRENT_UNIT_DATA                     = "Set Current Unit Data"

/////// IDD_DGN_PMCV_3D_DLG
IDD_DGN_PMCV_3D_DLG                           = "3D PM Curve"
IDS_DGN_PMCV_3D_NOT_EXIST_DATA                = "3D PM Curve Data is not exist."

IDC_RCS_MBAR_RHO_CMB                          = "Ratio of Main Rebar for Shear"
IDC_RCS_MBAR_RHO_LBL		                  = "Main Rebar Ratio"
